{"author": "TheView", "timestamp": "2020-06-19T00:00:000Z", "status": ".@ABC’s @MarthaRaddatz calls SCOTUS overturning Pres. Trump’s decision to end the DACA program “a huge blow to President Trump.” “One of the things the court said about President Trump’s action is they did not consider the impact on the recipients.” http://abcn.ws/2NbrEJy", "sentiment": "positive"}
{"author": "UnivisionNews", "timestamp": "2020-06-19T00:00:000Z", "status": "“We fought very hard for DACA and it feels really good that the Supreme Court agrees”. To talk about today’s Supreme Court decision and discuss what’s next, #UNews spoke to Juliana Macedo Do Nascimento, from @UNITEDWEDREAM, and a #DACA recipient. ", "sentiment": "positive"}
{"author": "CAgovernor", "timestamp": "2020-06-19T00:00:130Z", "status": "The state continues to stand behind undocumented Californians. Today's decision on #DACA reminds us we must fight for everyone to be treated with dignity &amp; respect. CA funds community legal services providers to support access to immigration relief. https://bit.ly/CAImmigrationResources", "sentiment": "positive"}
{"author": "__benadryl", "timestamp": "2020-06-19T00:00:160Z", "status": "I cried so hard this morning. Supreme Court approving to keep DACA was an answered prayer. I can finish out my senior year and graduate. Small step for mankind, bigger step for mona", "sentiment": "neutral"}
{"author": "Robert_Avossa", "timestamp": "2020-06-19T00:00:180Z", "status": "This may be the only good news I’ve heard in what feels like years - now back to the fight at hand #EndRacismNow #DACA ", "sentiment": "positive"}
{"author": "ButcherNate1", "timestamp": "2020-06-19T00:00:400Z", "status": "Why haven't DACA kids apply for citizenship?", "sentiment": "neutral"}
{"author": "OANN", "timestamp": "2020-06-19T00:00:590Z", "status": "Lawmakers, Pundits React To Supreme Court DACA Ruling https://www.oann.com/lawmakers-pundits-react-to-supreme-court-daca-ruling/ #OANN", "sentiment": "positive"}
{"author": "NBCLatino", "timestamp": "2020-06-19T00:02:330Z", "status": "Trump’s decision to end the DACA program, Sotomayor stated, was “contaminated” by “impermissible discriminatory animus” —citing Trump’s past comments against Mexicans. By ⁦@RaulAReyes⁩", "sentiment": "neutral"}
{"author": "NYCMayorsOffice", "timestamp": "2020-06-19T00:02:580Z", "status": "And don’t let anyone tell you otherwise. #DACA ", "sentiment": "neutral"}
{"author": "AlexPadilla4CA", "timestamp": "2020-06-19T00:03:140Z", "status": "Nearly 3 years ago, @realDonaldTrump made the cruel and unjust decision to try to end #DACA. Many of us urged Dreamers to keep the faith, keep fighting, and vowed to stand together with you. Today is your victory. ", "sentiment": "negative"}
{"author": "VanyNadi", "timestamp": "2020-06-19T00:03:260Z", "status": "Rocking my D&I pin today in honor of the Supreme Court #DACA decision! “It is time for parents to teach young people early on that in diversity there is beauty and there is strength.\"—Maya Angelou ", "sentiment": "positive"}
{"author": "RedState", "timestamp": "2020-06-19T00:04:000Z", "status": "The Supreme Court Rules Trump Can't End the Illegal DACA Program Because Nothing Matters Anymore ", "sentiment": "positive"}
{"author": "DavidColeStein", "timestamp": "2020-06-19T00:05:470Z", "status": "The Covid lockdowns, the BLM/ANTIFA terror riots, the #SCOTUS LGBT &amp; #DACA rulings... Straight whites have officially become the only group in the U.S. that A) has to abide by the laws, B) can't just do whatever as politicians pander &amp; excuse, C) has no advocates in high places.", "sentiment": "negative"}
{"author": "LPTexas", "timestamp": "2020-06-19T00:08:260Z", "status": "DACA recipients haven’t hurt you. They haven’t taken anything from you. Their presence in America has not violated your rights. But the government has hurt you. The government has taken from you, and it has violated your rights. Immigrants are not the problem. Government is.", "sentiment": "negative"}
{"author": "paulajean2020", "timestamp": "2020-06-19T00:09:120Z", "status": "Today's Supreme Court ruling was an important victory in protecting the Dream for people brought to this country as children, most of whom have known no other home than the US. But this is not the end of the fight. Let's flip the Senate &amp; make it a law! #NotMeUs #DACA ", "sentiment": "negative"}
{"author": "AdelitasApparel", "timestamp": "2020-06-19T00:09:430Z", "status": "We will be accepting donations to fund DACA renewals. This QR code will take you to the application if you are in need of funds. There will be more stickers coming soon that we will use to raise money for the DACA fund! ", "sentiment": "positive"}
{"author": "sahilkapur", "timestamp": "2020-06-19T00:11:330Z", "status": "This was on the table in 2018: A deal with $25 billion for the wall and DACA path to citizenship. A number of Senate Rs were on board but Trump torched it. He wanted to add cuts to family green cards and diversity visas. @StevenTDennis and me at the time: https://www.bloomberg.com/news/articles/2018-12-13/how-trump-let-his-goal-of-building-a-border-wall-slip-away", "sentiment": "negative"}
{"author": "cspan", "timestamp": "2020-06-19T00:12:000Z", "status": ".@SpeakerPelosi on #SCOTUS #DACA decision: \"The DACA decision is something that supports our values as a country...this way is the American way and we've very proud of it.\" Full video: https://cs.pn/2Yfxgc6", "sentiment": "positive"}
{"author": "NinaTotenberg", "timestamp": "2020-06-19T00:14:000Z", "status": "After #SCOTUS decision, Trump lacks the time to rescind #DACA before January. But, if he’s reelected, immigration experts say he will almost certainly try again. ", "sentiment": "positive"}
{"author": "aleistalking", "timestamp": "2020-06-19T00:14:070Z", "status": "OPEN LETTER: FOLLOWING ABRUPT END TO ROUNDTABLE WITH @GovInslee , DACA RECIPIENTS DEMAND PUBLIC MEETING, COMMITMENTS, AND APOLOGY. Written by @LCortesRomero, @Kamaumaumau, and myself. You can read the entire letter here: https://docs.google.com/document/d/1hjA_oPPfW0MGto_AizOKE9E_zijojuKzH4ve7kJNmnM/edit?usp=sharing", "sentiment": "positive"}
{"author": "sendavidperdue", "timestamp": "2020-06-19T00:14:230Z", "status": "Let’s not forget: In 2018, President @realDonaldTrump offered a pathway to citizenship for 1.8 million DACA recipients, but Democrats rejected this proposal.", "sentiment": "negative"}
{"author": "davidfrum", "timestamp": "2020-06-19T00:15:180Z", "status": "Trump wasn't wrong to take the Supreme Court's DACA decision personally, latest in @TheAtlantic", "sentiment": "positive"}
{"author": "Camila_Cabello", "timestamp": "2020-06-19T00:19:540Z", "status": "mi gente ! what a day! the Supreme Court ruled that the trump administration couldn’t immediately proceed with its plan to end DACA- we still have a lot of work to do in protecting them, but this is an amazing victory. Their home is HERE. ", "sentiment": "positive"}
{"author": "nowthisnews", "timestamp": "2020-06-19T00:23:000Z", "status": "The Supreme Court ruled that the Trump admin violated federal law when it rescinded DACA and that it can’t end the program. DACA protects 700,000 young immigrants from deportation. It allows recipients to work legally in the U.S. but does not provide a pathway to citizenship. ", "sentiment": "positive"}
{"author": "HuffPost", "timestamp": "2020-06-19T00:23:350Z", "status": "The Supreme Court blocked the Trump administration from ending DACA. ", "sentiment": "positive"}
{"author": "debraraes", "timestamp": "2020-06-19T00:24:530Z", "status": "Clarence Thomas Calls Out Fellow Justices; Political Hypocrisy in Scorching DACA Dissent https://www.westernjournal.com/clarence-thomas-calls-fellow-justices-political-hypocrisy-scorching-daca-dissent/?utm_source=Twitter&amp;utm_medium=PostSideSharingButtons&amp;utm_campaign=websitesharingbuttons #ConservativeScotusNOW .@realDonaldTrump #KAG #TAP #TRUMP2020 #MAGA #WWG1WGA", "sentiment": "neutral"}
{"author": "LewisForMN", "timestamp": "2020-06-19T00:27:180Z", "status": "Minnesota’s unemployment rate hit 9.9%, the highest in history. So what’s @TinaSmithMN talking about? - Coffee in her mansion - Trolling @realDonaldTrump - Selling Merch - DACA That’s right, 10% of MN is unemployed &amp; Tina cares more about selling merch!", "sentiment": "positive"}
{"author": "brhodes", "timestamp": "2020-06-19T00:29:190Z", "status": "Obama announced DACA after the Senate refused to pass the DREAM Act - which passed the House and had 55 votes in the Senate, but was blocked by McConnell and Cornyn. Another reason to abolish the filibuster. ", "sentiment": "negative"}
{"author": "Samyann_Writer", "timestamp": "2020-06-19T00:29:430Z", "status": "27,000 health workers keeping Americans alive through this COVID pandemic are part of the DACA program. 27,000 nurses, doctors, most here since they were little kids, are keeping YOU alive.", "sentiment": "positive"}
{"author": "SheriffEd_HCSO", "timestamp": "2020-06-19T00:35:030Z", "status": "I support #SCOTUS decision allowing #DACA to remain in place, but it’s only a temporary fix. Congress must still act and advance a long-overdue legislative solution for #Dreamers that will benefit all Americans.", "sentiment": "positive"}
{"author": "RoyCooperNC", "timestamp": "2020-06-19T00:38:170Z", "status": "Let’s celebrate the hard fought Supreme Court ruling for DACA recipients in North Carolina and across the country. America is the only home these hard working young people have ever known and they deserve a bright future right here in the United States.", "sentiment": "positive"}
{"author": "BradBirdA113", "timestamp": "2020-06-19T00:40:030Z", "status": "Go DACA. Go dreamers! ", "sentiment": "neutral"}
{"author": "bryanbehar", "timestamp": "2020-06-19T00:43:340Z", "status": "Bolton book. DACA &amp; LGBT rulings. Covid deaths. Civil unrest. Mass unemployment. So, Donald, how was your week?", "sentiment": "negative"}
{"author": "Barnes_Law", "timestamp": "2020-06-19T00:43:550Z", "status": "Maybe #SCOTUS helped @realDonaldTrump this week? Imagine a headline Monday that read \"Trump justices say discrimination against gays ok\" and then a headline today read \"Trump justices say Trump can kick DACA kids out of USA.\" Trump keeps campaign issues w/o immediate consequence.", "sentiment": "neutral"}
{"author": "chasestrangio", "timestamp": "2020-06-19T00:44:170Z", "status": "There are still huge cases to come this term at SCOTUS but the fact that we don't have to dread DACA and Title VII is really going to change Monday mornings for me.", "sentiment": "positive"}
{"author": "TTuberville", "timestamp": "2020-06-19T00:45:010Z", "status": "By upholding DACA today, the Supreme Court put swampy political correctness ahead of the rule of law and the everyday, hardworking Americans who have joined President Trump in making our country great again.", "sentiment": "positive"}
{"author": "AGHamilton29", "timestamp": "2020-06-19T00:45:110Z", "status": "Roberts has shown a bad habit on big cases of looking for a way to deflect responsibility with narrow rulings that avoid the substance of the case. There is clearly no good legal argument for saying Trump admin can't rescind DACA so majority focused on proper way to rescind.", "sentiment": "negative"}
{"author": "Hobbit4DJT", "timestamp": "2020-06-19T00:47:190Z", "status": " Supreme Court’s decisions make it more apparent that a Trump re-election is key to preserving American liberties from grasping hands of a progressive state.” Clarence Thomas Calls Out Fellow Justices' Political Hypocrisy in Scorching DACA Dissent ", "sentiment": "positive"}
{"author": "jewishaction", "timestamp": "2020-06-19T00:48:290Z", "status": "It’s been a busy day. Facebook had to take down Trump’s Nazi ads. DACA is here to stay. To all of our new followers: Welcome! And one more thing: Black Lives Matter. Black Lives Matter. Black Lives Matter. Black Lives Matter. Black Lives Matter. Black Lives Matter.", "sentiment": "positive"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T00:51:410Z", "status": "#DACA lives, for now. But the fight is far from over. #SCOTUS ruled that the Trump administration may not immediately end DACA, but the temporary win comes with strings attached. Today we celebrate. Tomorrow the fight continues. #DontLookAway Here’s what that means ", "sentiment": "positive"}
{"author": "BetoORourke", "timestamp": "2020-06-19T00:52:260Z", "status": "Organizations like Las Americas in El Paso are on the front lines, providing legal services, financial support, and counseling to the 100k+ Texas families impacted by today’s SCOTUS decision on DACA. Show your support here. #HomeIsHere #HomeIsTexas", "sentiment": "positive"}
{"author": "steve_vladeck", "timestamp": "2020-06-19T00:52:360Z", "status": "The Trump DOJ has filed nine petitions with #SCOTUS for “certiorari before judgment” (an unusual request for a merits ruling before the court of appeals rules). Although the Court’s granted five of the petitions, with #DACA, it’s now ruled against the government in all of them. ", "sentiment": "positive"}
{"author": "MiraSorvino", "timestamp": "2020-06-19T00:52:450Z", "status": "Hooray!! #DACA ", "sentiment": "positive"}
{"author": "joseiswriting", "timestamp": "2020-06-19T00:56:220Z", "status": "SCOTUS' ruling on #DACA \"affirms something I have always felt to be true: This is my country, my home, and I belong here. We belong here: https://www.washingtonpost.com/opinions/at-last-we-dreamers-can-sleep-soundly-again-but-next-comes-citizenship/2020/06/18/a3ea978c-b19b-11ea-8758-bfd1d045525a_story.html via my dear friend @GabyPacheco1 of @thedream_us", "sentiment": "positive"}
{"author": "Arkiegirl01", "timestamp": "2020-06-19T01:00:430Z", "status": "‘I Invite Him To Resign’: Tom Cotton Rips John Roberts, Supreme Court Over DACA Decision | The Daily Caller https://dailycaller.com/2020/06/18/tom-cotton-daca-john-roberts-supreme-court/", "sentiment": "positive"}
{"author": "MynorRodriguezz", "timestamp": "2020-06-19T01:04:580Z", "status": "Is your boyfriend paying for your DACA renewal or do I have to?", "sentiment": "neutral"}
{"author": "allinwithchris", "timestamp": "2020-06-19T01:05:000Z", "status": "DACA lawyer Xavier Becerra on SCOTUS decision: “It’s one of those cases where I think all of us can take a big sigh of relief believing that maybe the rule of law still exists in this country, even with Donald Trump in the White House.” https://on.msnbc.com/3fE7G6a #inners", "sentiment": "positive"}
{"author": "ACLU", "timestamp": "2020-06-19T01:07:020Z", "status": "Hear our deputy organizing director and Dreamer @BlancaSprkls' reaction to this morning's SCOTUS decision on DACA. ", "sentiment": "neutral"}
{"author": "Sifill_LDF", "timestamp": "2020-06-19T01:09:080Z", "status": "We’re thrilled w/the result in the #DACA case &amp; what it means for hundreds of thousands of Dreamers. But there are problems with the #DACA decision. Read this important thread from @NAACP_LDF Litigation Dir. Sam Spital.", "sentiment": "negative"}
{"author": "JessLivMo", "timestamp": "2020-06-19T01:10:280Z", "status": "MANY, many, many people got us to this place on DACA. I feel so lucky to have learned from so many of them, but I want honor five very special women who are my North Stars on this. Love to you, sisters. @Grei_sa @CrisAlexJimenez @lorellapraeli @ErikaAndiola @leedsgarcia", "sentiment": "positive"}
{"author": "ariannamalvar", "timestamp": "2020-06-19T01:11:400Z", "status": "I’m happy to say that I worked for a woman like @ewarren that contacts all of of DACA ex-organizers to congratulate them for their win... this woman cares. and that’s all I’ve ever wanted from a pres - she never stops showing that she cares.", "sentiment": "positive"}
{"author": "KayaJones", "timestamp": "2020-06-19T01:14:120Z", "status": "40 million Americans are out of work and the Supreme Court made it illegal today to hire U.S. citizens over DACA recipients. ", "sentiment": "neutral"}
{"author": "Lowcountry1Girl", "timestamp": "2020-06-19T01:18:200Z", "status": "Tom Cotton Rips John Roberts, Supreme Court Over DACA Decision. It CANNOT be the law that what Obama has UNLAWFULLY done ...no President may undo. Yet, John Roberts postured, making the SCOTUS questionable at best. ", "sentiment": "positive"}
{"author": "angie_keathly", "timestamp": "2020-06-19T01:20:380Z", "status": "DACA Recipients Celebrate SCOTUS Ruling “I’ve worked so hard to get where I’m at..I’m taking every little win with a smile…If there’s anything that immigrants always are, it’s that we’re ready.”—A DACA recipient. And..We Move Forward. #OneV1 #OVTTDS", "sentiment": "positive"}
{"author": "christianllamar", "timestamp": "2020-06-19T01:24:200Z", "status": "DACA decision is just a stalling tactic, read the dissent of Justice Clarence Thomas. LGBTQ decision did not change existing law &amp; there is still a built in religious exemption into the Title VII. Neither side really gained ground &amp; both sides have moved farther from each other.", "sentiment": "positive"}
{"author": "clarise__rivera", "timestamp": "2020-06-19T01:27:500Z", "status": "A quick reminder: • BLM is a movement, not a trend • Cops receive more funds than education • Yemen‘s still facing the worst humanitarian crisis • DACA remains • We’re the future. Keep signing petitions, educate your loved ones/acquaintances, use your voice", "sentiment": "negative"}
{"author": "sxdoc", "timestamp": "2020-06-19T01:29:230Z", "status": "Patriots Setup Hidden Traps Everywhere, [DS] Continues To Fall Into Them: Stormy Daniels, Avanetti, Bolton- all reveal more info about DS! SCOTUS DACA Ruling MEANS TRUMP can make legal laws like VOTER ID by EO! FB Exposed Hires Chinese H1B 1st! ", "sentiment": "positive"}
{"author": "savethechop", "timestamp": "2020-06-19T01:30:400Z", "status": "So DACA was illegal to start with, but it can’t be rolled back because the legal argument wasn’t good enough? I need a bigger gun safe.", "sentiment": "positive"}
{"author": "AlexMarlow", "timestamp": "2020-06-19T01:31:000Z", "status": "The Court said that the Trump admin failed to consider “the hardship to DACA recipients” before rescinding DACA. And how exactly is the hardship of illegal immigration the President or citizens’ fault? ", "sentiment": "negative"}
{"author": "MotherJones", "timestamp": "2020-06-19T01:31:240Z", "status": "“I thought I could not love Justice Sotomayor any more than I did already. Then I read her DACA concurrence.” ", "sentiment": "negative"}
{"author": "ABishopGustavo", "timestamp": "2020-06-19T01:35:570Z", "status": "DACA brothers and sisters, sleep well tonight! Dios cuide su seño.", "sentiment": "positive"}
{"author": "SenMcCollister", "timestamp": "2020-06-19T01:38:590Z", "status": "Today is a great day. The Supreme Court ruled that the Trump admin. acted ILLEGALLY in rescinding DACA and the program will remain in effect. The Deferred Action for Childhood Arrivals program allowed young people who came here as children to work LEGALLY in the United States.", "sentiment": "positive"}
{"author": "PalmerReport", "timestamp": "2020-06-19T01:44:570Z", "status": "Trump calls for violence after Supreme Court rules against him on DACA ", "sentiment": "negative"}
{"author": "UNTPrez", "timestamp": "2020-06-19T01:46:540Z", "status": "This is a great day...so happy for our DACA students. ", "sentiment": "positive"}
{"author": "COsweda", "timestamp": "2020-06-19T01:49:040Z", "status": "Let's review: Obama implemented the Deferred Action for Childhood Arrivals Program (DACA) by fiat. That is, he had no authority to do so. Trump asked the court to rule on the legality of DACA.", "sentiment": "negative"}
{"author": "COsweda", "timestamp": "2020-06-19T01:50:250Z", "status": "\"We do not decide whether DACA or its rescission are sound policies. We address only whether the agency complied with the procedural requirement that it provide a reasoned explanation for its action.\"", "sentiment": "neutral"}
{"author": "COsweda", "timestamp": "2020-06-19T01:50:440Z", "status": "\"Here the agency failed to consider the conspicuous issues of whether to retain forbearance and what if anything to do about the hardship to DACA recipients.\"", "sentiment": "negative"}
{"author": "CrisAlexJimenez", "timestamp": "2020-06-19T01:52:240Z", "status": "When your therapist calls you on #DACA #SCOTUS decision day to congratulate you &amp; show support ", "sentiment": "positive"}
{"author": "CNN", "timestamp": "2020-06-19T01:53:150Z", "status": "The Supreme Court blocked the Trump administration’s attempt to end DACA, an Obama-era program that protects hundreds of thousands of immigrants brought to the US as children from deportation ", "sentiment": "positive"}
{"author": "ari_russian", "timestamp": "2020-06-19T01:54:030Z", "status": "Chief Justice John Roberts is the John McCain of the Supreme Court. #SCOTUS #Obamacare #DACA", "sentiment": "positive"}
{"author": "sdutIdeas", "timestamp": "2020-06-19T01:54:140Z", "status": "As a reporter, I tell San Diego’s stories. With DACA safe for now, here’s mine. @andrealopezvil writes:", "sentiment": "positive"}
{"author": "neal_katyal", "timestamp": "2020-06-19T01:55:230Z", "status": "Neal Katyal: Trump's comments on SCOTUS DACA ruling 'corrosive to the rule of law' ", "sentiment": "neutral"}
{"author": "ReachHigher", "timestamp": "2020-06-19T01:58:430Z", "status": "For so many young people across this county, DACA allowed them the opportunity to pursue higher education and #ReachHigher. We support DREAMers because all students deserve the full opportunity to reach as high as they want without boundaries or fear.", "sentiment": "positive"}
{"author": "neal_katyal", "timestamp": "2020-06-19T01:59:550Z", "status": "Joining @Lawrence at 10:30 ET tonight on @MSNBC to talk further about DACA and the Supreme Court.", "sentiment": "positive"}
{"author": "CNNPolitics", "timestamp": "2020-06-19T02:02:060Z", "status": "Education Secretary Betsy DeVos is still fighting to exclude DACA students from coronavirus aid https://cnn.it/3dihnFQ", "sentiment": "negative"}
{"author": "CuomoPrimeTime", "timestamp": "2020-06-19T02:09:350Z", "status": "Acting Deputy Secretary of Homeland Security Ken Cuccinelli says he can’t say whether Pres. Trump will take action on the future of DACA but that he would be open to negotiating it after the Supreme Court blocked the administration from ending it. https://cnn.it/30UZdHH", "sentiment": "positive"}
{"author": "RepMcClintock", "timestamp": "2020-06-19T02:09:450Z", "status": "The Supreme Court decision on DACA means exactly this: an unlawful act by a past president can only be rescinded by pretending it is a lawful act. This defies logic and is a body blow to the Constitution.", "sentiment": "positive"}
{"author": "morninggloria", "timestamp": "2020-06-19T02:09:540Z", "status": "Pretty stoked that SCOTUS affirmed LGBTQ+ rights and the rights of DACA recipients, will allow myself to fully feel the joy of all three surprise victories if and when the court rules the right way on June Medical Services v Russo (abortion). Until then, dread-tinged.", "sentiment": "positive"}
{"author": "SenTedCruz", "timestamp": "2020-06-19T02:10:380Z", "status": "WATCH : Speaking with @IngrahamAngle on @FoxNews at ~9:20pm CT to discuss today’s disgraceful #SCOTUS #DACA decision. Tune in!", "sentiment": "neutral"}
{"author": "uiwcardinals", "timestamp": "2020-06-19T02:11:220Z", "status": "\"To the Dreamers in our student community, we stand with you and celebrate today’s decision.\" - UIW President, Dr. Thomas M. Evans Click here to read Dr. Evans' full message regarding today's Supreme Court DACA decision: https://bit.ly/3fvtroS", "sentiment": "positive"}
{"author": "kerritalbot", "timestamp": "2020-06-19T02:16:050Z", "status": "I’ve counted 60 Ds and Republican Senators today saying Congress should do something for DACA recipients. So do it- pass Dream and Promise. You could pass it tomorrow!", "sentiment": "positive"}
{"author": "ErikaAndiola", "timestamp": "2020-06-19T02:21:450Z", "status": "Here's a better promise. If elected, you use your authority on DAY ONE of your presidency to expand DACA and stop the deportation machine Obama started and Trump strengthened. We won't buy another Obama like promise and 3 million more deportations. #MigrantJusticeDayOne", "sentiment": "positive"}
{"author": "MSNBC", "timestamp": "2020-06-19T02:23:020Z", "status": "California AG Becerra on the US Supreme Court DACA decision: “It’s one of those cases where I think all of us can take a big sigh of relief believing that maybe the rule of law still exists in this country, even with Donald Trump in the White House.” https://on.msnbc.com/2YIF9FS", "sentiment": "positive"}
{"author": "LastStand2019", "timestamp": "2020-06-19T02:24:210Z", "status": "So who holds corrupt Supreme Justices accountable? Chief Justice John Roberts In compromised and has gone corrupt and if hes not stopped he will destroy the USA Clarence Thomas Calls Out Fellow Justices' Political Hypocrisy in Scorching DACA Dissent ", "sentiment": "positive"}
{"author": "lsarsour", "timestamp": "2020-06-19T02:25:460Z", "status": "Today was a GREAT DAY. From the remarkable #SCOTUS decision on #DACA to my beloved son turning 21 years old! Blessed and grateful. ", "sentiment": "positive"}
{"author": "P8R1OT", "timestamp": "2020-06-19T02:33:440Z", "status": "DACA is unconstitutional and illegal, just like the people it protects... Retweet if you think Justice Roberts is a traitor...", "sentiment": "positive"}
{"author": "AdyBarkan", "timestamp": "2020-06-19T02:35:020Z", "status": "All hail @CrisAlexJimenez and the movement of brave brilliant immigrant youth that she has led! I love you Cristina! #DACA ", "sentiment": "positive"}
{"author": "JohnCooper0610", "timestamp": "2020-06-19T02:37:300Z", "status": "Bottom line Obama acted lawlessly granting DACA. Chief Justice Roberts told Trump he has to give him a BETTER EXPLANATION as to why he wants to rescind this lawlessness. Remember that on November 3rd.", "sentiment": "positive"}
{"author": "MauriceWFP", "timestamp": "2020-06-19T02:38:110Z", "status": "There is no Black freedom without immigrant rights. Still in awe of what the soldiers in the #DACA movement accomplished today. To more victories. #HereToStay #DefendBlackLives", "sentiment": "negative"}
{"author": "wirelesshogan", "timestamp": "2020-06-19T02:38:190Z", "status": "What Chief Justice Roberts should have written: \"US is a colonial nation that stole & ethnically cleansed these lands. DACA was not written by natives, this lawsuit was not filed by natives &amp; SCOTUS has no native justices. This case is without merit &amp; SCOTUS has no jurisdiction.\"", "sentiment": "negative"}
{"author": "davidfrum", "timestamp": "2020-06-19T02:38:290Z", "status": "Latest in @TheAtlantic In the Muslim ban case, Roberts CJ pretended to believe Trump's account of his actions. In the DACA case, Roberts CJ decided he could sustain the pretense no longer ", "sentiment": "negative"}
{"author": "SteveRustad1", "timestamp": "2020-06-19T02:40:340Z", "status": "The GOP blamed Obama when 4 Americans died in Benghazi. They were outraged. 117,000 Americans have died in the pandemic. The GOP response? No outrage. Endless praise for Trump. Craven assholes. #BoycottAMC #DeSantisBetrayedFlorida Nestor Pompeo \"Todler\" Amy Klobuchar DACA pic.twitter.com/1ft2l71Anz", "sentiment": "negative"}
{"author": "washingtonpost", "timestamp": "2020-06-19T02:48:060Z", "status": "Opinion: The Supreme Court’s DACA decision is a political trap for Trump ", "sentiment": "positive"}
{"author": "omarsuleiman504", "timestamp": "2020-06-19T02:53:410Z", "status": "Grateful for the #Daca victory today. Committed to your full ability to dream tomorrow. Let’s keep fighting. ", "sentiment": "positive"}
{"author": "Redhead4645", "timestamp": "2020-06-19T02:55:290Z", "status": "John Eastman! @POTUS can get his tees crossed and his i’s dotted by July and get DACA RECINDED That is if Justice Roberts is telling the truth The President has the power to rescind this lawless EO of Obama! I have every faith Trump and his team will get it done! #Trump2020", "sentiment": "positive"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T02:55:390Z", "status": "What RAICES is doing: Free consultations to assess eligibility for DACA Free legal representation for DACA Opportunities to become involved in Advocacy opportunities. Text DACA2020 to 51555 to get our action alerts!", "sentiment": "positive"}
{"author": "cesar235_", "timestamp": "2020-06-19T02:55:590Z", "status": "Marry a DACA recipient and give them a path to citizenship ", "sentiment": "neutral"}
{"author": "ddwiese", "timestamp": "2020-06-19T02:57:040Z", "status": "Democrats are SO short-sighted, celebrating their DACA win. President Trump can issue a LOT of EOs before he leaves. And apparently, they’ll be untouchable. Enjoy your “win.”", "sentiment": "positive"}
{"author": "SenTedCruz", "timestamp": "2020-06-19T02:59:430Z", "status": "This was a disastrous week at the Supreme Court. Today’s lawless #DACA decision was about 5 justices who want amnesty to continue and are hoping that, in November, there will be a Democratic President who also ignores the law. ", "sentiment": "positive"}
{"author": "latimes", "timestamp": "2020-06-19T02:59:550Z", "status": "After Supreme Court DACA decision, state universities commit support to immigrant students ", "sentiment": "positive"}
{"author": "eddienavarrete", "timestamp": "2020-06-19T03:06:420Z", "status": "Very happy today. #DREAMers are here to stay because their #HomeIsHere. #SCOTUS #DACA ", "sentiment": "positive"}
{"author": "JayesGreenJ", "timestamp": "2020-06-19T03:14:070Z", "status": "Two things I get to keep for a little while longer: my DACA and this little nose ring. ", "sentiment": "neutral"}
{"author": "NBCLatino", "timestamp": "2020-06-19T03:15:000Z", "status": "Trump \"branded\" Mexicans and immigrants as \"less desirable,\" stated Justice Sonia Sotomayor. That can't be dismissed from his desire to end #DACA, she said in her separate opinion. By @RaulAReyes", "sentiment": "positive"}
{"author": "UndocuCouncil", "timestamp": "2020-06-19T03:15:220Z", "status": "Go Go Go Renew and/or Apply for #DACA! ", "sentiment": "neutral"}
{"author": "Vzladream", "timestamp": "2020-06-19T03:16:170Z", "status": "All the judges know that DACA is illegal but they don’t care. They are preventing the president from making right what is now wrong =DACA. Roberts is playing games. ", "sentiment": "neutral"}
{"author": "washingtonpost", "timestamp": "2020-06-19T03:24:050Z", "status": "Opinion: In big DACA ruling, Trump’s bad faith blew up in his face ", "sentiment": "negative"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T03:24:300Z", "status": "Folks: We're happy to announce we've been able to re-open our #DACA assistance fund with today's news. If you are in need of assistance with your DACA renewal fees please apply in the link below ", "sentiment": "positive"}
{"author": "thedailybeast", "timestamp": "2020-06-19T03:30:030Z", "status": "Another signature Trump initiative is rejected by the Court because the administration bungled its implementation. It bears noting that the Court did not rule on DACA itself – only on the flawed process of repealing it. ", "sentiment": "negative"}
{"author": "TIME", "timestamp": "2020-06-19T03:31:580Z", "status": "“Right now we’re celebrating, but there’s also this humongous possibility to do more for our community,” says one DACA recipient. “This is a moment of joy, but think we also have to recenter ourselves in the longer fight\" ", "sentiment": "positive"}
{"author": "SafetyPinDaily", "timestamp": "2020-06-19T03:35:020Z", "status": "California Judge Blocks DeVos Rule Banning DACA Students From Stimulus || Via: Forbes ", "sentiment": "negative"}
{"author": "leahmcelrath", "timestamp": "2020-06-19T03:36:140Z", "status": "Hey, remember the great news about the SCOTUS decision on DACA? That was this morning.", "sentiment": "positive"}
{"author": "colbertlateshow", "timestamp": "2020-06-19T03:38:290Z", "status": "The Supreme Court ruled against Trump's attempt to end DACA, so Ben &amp; Jerry's is introducing a new flavor! #LSSC", "sentiment": "positive"}
{"author": "latinovictoryus", "timestamp": "2020-06-19T03:41:530Z", "status": "This evening, VP @JoeBiden turned his Instagram account over to @marianalesandra — a Floridian, longtime advocate, and Dreamer — to share her DACA story &amp; what today’s decision means to her. WATCH: ", "sentiment": "positive"}
{"author": "ElieNYC", "timestamp": "2020-06-19T03:44:380Z", "status": "Come for my explanation of why Roberts ruled for DACA but against Muslims, stay for the monkeys typing Hamlet snark. ", "sentiment": "neutral"}
{"author": "donaldrusso994", "timestamp": "2020-06-19T03:45:430Z", "status": "I see that SCOTUS decided to force the EO of Barry on DACA down the throat of @POTUS Hmm...So in the future, all EO's of @realDonaldTrump are equally cut in granite and unassailable?", "sentiment": "negative"}
{"author": "kuruchitx", "timestamp": "2020-06-19T03:49:060Z", "status": "Y’all know they only let y’all keep DACA cuz they knew they would have a bunch of illegals hitting the streets, on top of the ongoing uprisings, instead now everyone talking about saving money for traveling lmaooooo ", "sentiment": "positive"}
{"author": "ABC", "timestamp": "2020-06-19T03:52:040Z", "status": "Joe Biden: “The Supreme Court’s ruling today is a victory made possible by the courage and resilience of hundreds of thousands of DACA recipients...As President, I will immediately work to make it permanent.\" https://abcn.ws/3es7t6d", "sentiment": "positive"}
{"author": "nxkkrxnn", "timestamp": "2020-06-19T03:52:200Z", "status": "DACA recipients on the TL today: congrats y’all ", "sentiment": "positive"}
{"author": "L_Toczylowski", "timestamp": "2020-06-19T03:55:220Z", "status": "Any employers who are posting stuff in support of DACA today should find space in their budgets to cover their employee’s DACA renewal fees without them having to ask you first.", "sentiment": "positive"}
{"author": "RedState", "timestamp": "2020-06-19T04:04:000Z", "status": "The Supreme Court Rules Trump Can't End the Illegal DACA Program Because Nothing Matters Anymore https://www.redstate.com/bonchie/2020/06/18/breaking-supreme-court-rules-trump-cant-end-daca/?utm_source=Twitter&amp;utm_medium=social&amp;utm_term=breaking-supreme-court-rules-trump-cant-end-daca&amp;utm_content=3&amp;utm_campaign=PostPromoterPro", "sentiment": "positive"}
{"author": "ABC", "timestamp": "2020-06-19T04:06:030Z", "status": "Pres. Trump criticized the Supreme Court after LGBTQ, DACA decisions, tweeting, \"Do you get the impression that the Supreme Court doesn’t like me?\" https://abcn.ws/2UX35UY", "sentiment": "positive"}
{"author": "BuddJenn", "timestamp": "2020-06-19T04:07:010Z", "status": "Was really good to get out and celebrate the DACA decision with my friends and family. So proud of how hard everyone has fought. Tomorrow we will fight again.", "sentiment": "positive"}
{"author": "sxdoc", "timestamp": "2020-06-19T04:16:450Z", "status": "The SCOTUS decision on DACA gives the President (Trump) the power to write laws by EXECUTIVE ORDER and SCOTUS must be consistent based on precedent and uphold it. The FIRST law Trump should write is VOTER ID. Even Mexico &amp; 3rd world countries have this law! ", "sentiment": "neutral"}
{"author": "realoverheardla", "timestamp": "2020-06-19T04:21:000Z", "status": "“My ex was on the Supreme Court case that won DACA today and I can’t even fill out unemployment correctly.”", "sentiment": "positive"}
{"author": "CattHarmony", "timestamp": "2020-06-19T04:28:010Z", "status": "Tom Cotton rips John Roberts for the Supreme Court’s DACA decision: \"I invite him to resign.\" John Roberts is a disgrace to say the least... #StopActivistJudges", "sentiment": "negative"}
{"author": "haifakahmed", "timestamp": "2020-06-19T04:28:290Z", "status": "Keep protesting, keep donating, keep signing. Keep fighting for Black lives matter DACA Against ICE Against the pigs Yemen Palestine Sudan Ughyur Muslims Refugees Abortion rights Mental health rights Gun reform And everything that stands for the betterment of humanity.", "sentiment": "negative"}
{"author": "BuffyWicks", "timestamp": "2020-06-19T04:31:260Z", "status": "Congratulations to @JuanSaaa, and all the #Dreamers who fought so hard to make today’s #DACA victory a reality! The fight goes on — but today you get to celebrate and take a bow! Well done! #HomeIsHere", "sentiment": "positive"}
{"author": "jilevin", "timestamp": "2020-06-19T04:33:030Z", "status": "She's a nurse with DACA protections. The coronavirus pandemic was a call to duty ", "sentiment": "neutral"}
{"author": "rulajebreal", "timestamp": "2020-06-19T04:39:530Z", "status": "Justice Sotomayor calls it as it is: Don't tell me Trump wasn't being RACIST when trying to kill DACA! POTUS calling immigrants “criminals, rapists &amp; animals” helps create the strong perception that the rescission decision was contaminated by impermissible discriminatory animus. ", "sentiment": "positive"}
{"author": "IceoutofTarrant", "timestamp": "2020-06-19T04:45:380Z", "status": "Important breakdown of DACA decision today!! ", "sentiment": "positive"}
{"author": "ciriacisbeth", "timestamp": "2020-06-19T04:46:590Z", "status": "Small victory, and joy that’s complicated and that’s okay! If you’re a DACA recipient in Utah, visit: https://utahdaca.com/en/ for resources and information RT!! ", "sentiment": "positive"}
{"author": "TheCptBlackPill", "timestamp": "2020-06-19T04:47:000Z", "status": "In all my life, I have never seen so much winning: 120,000 dead Americans, economic collapse, endless riots, destruction of monuments, Bolshevik purges, police reform, conservatives on the Supreme Court legislating DACA and the Equality Act. Just imagine four more years of this ", "sentiment": "negative"}
{"author": "elyssagabs", "timestamp": "2020-06-19T05:04:250Z", "status": "Helloooo, I’ve had a few people tell me not to share post on Facebook in relation to BLM, DACA, etc because it could look bad for jobs. And I have to say: I do NOT want to work for anyone/any company who does not support basic human rights.", "sentiment": "negative"}
{"author": "13thethe", "timestamp": "2020-06-19T05:07:030Z", "status": "The #SCOTUS Rules Trump Can’t End the Illegal DACA Program No surprise, John Roberts was appointed by Deep State George W. Bush &amp; was groomed for these kinds of decisions! These kinds of rulings will have this Country down on its knees #DrainTheDeepState", "sentiment": "negative"}
{"author": "sfchronicle", "timestamp": "2020-06-19T05:07:240Z", "status": "What is DACA? Everything you need to know about DACA, explained: ", "sentiment": "neutral"}
{"author": "Javier_SRr", "timestamp": "2020-06-19T05:09:220Z", "status": "Today I saw this and my world lit up in a way I can’t explain. This opens up a world for me and other people my age who couldn’t receive DACA. This is our lottery ticket ! ", "sentiment": "neutral"}
{"author": "SophiaBush", "timestamp": "2020-06-19T05:12:590Z", "status": "Here to stay. #DACA • My grandmother and great grandparents came here with a dream. My father came here with a dream. Dreams are for all of us. Denying them is to deny the loftiest intentions of our founding… https://www.instagram.com/p/CBmsDVwpn_z/?igshid=l5yem9n4llir", "sentiment": "positive"}
{"author": "kyabolitionists", "timestamp": "2020-06-19T05:19:260Z", "status": "We are celebrating DACA’s victory, but we are not settling until we reach Black Liberation. It’s time to reflect on immigration organizing &amp; how Mexican-centric &amp; anti-Black it is. DACA was never the solution, abolition is.", "sentiment": "neutral"}
{"author": "gob", "timestamp": "2020-06-19T05:26:510Z", "status": "my friends @mep and nico and I made this song earlier this year. the simple sentiment — welcome — might apply in a bunch of contexts. and it’s not quite fully mixed yet. but we wanted to dedicate it to the DACA Dreamers out there on this day. “your house.” ", "sentiment": "positive"}
{"author": "cuban_manny", "timestamp": "2020-06-19T05:29:290Z", "status": "#America now we are witnessing in historic proportions what “DRAINING THE SWAMP” really means ! We just witnessed this week with Chief Justice Roberts of the Supreme Court siding with Obama’s illegal decision on DACA ! #WakeUpAmerica #WWG1GWA #MAGAA2020 ", "sentiment": "positive"}
{"author": "HuffPostPol", "timestamp": "2020-06-19T05:33:220Z", "status": "The Supreme Court blocked the Trump administration from ending DACA, keeping 650,000 young, undocumented immigrants safe from deportation. ", "sentiment": "positive"}
{"author": "NBCNews", "timestamp": "2020-06-19T05:40:030Z", "status": "US Supreme Court Justice Sotomayor drew a clear line between President Trump’s history of remarks against Mexicans and immigrants and the admin.'s position on DACA. https://nbcnews.to/3df5DEb", "sentiment": "positive"}
{"author": "filnj", "timestamp": "2020-06-19T05:42:370Z", "status": "'Unlawful from its Inception': Justice Thomas Rips DACA Decision ", "sentiment": "positive"}
{"author": "johncwingfield", "timestamp": "2020-06-19T05:43:230Z", "status": "the supreme court just ruled in favor of DACA can i get a w in the chat", "sentiment": "positive"}
{"author": "TheAtlantic", "timestamp": "2020-06-19T05:44:120Z", "status": "\"Nearly 700,000 DACA recipients currently in the program need not fear lightning Immigration and Customs Enforcement raids for a while longer,\" @profepps writes:", "sentiment": "positive"}
{"author": "dailymemphian", "timestamp": "2020-06-19T05:59:170Z", "status": "Christian Brothers University will have about 150 DACA students on its campus this fall and is looking to recruit more. ", "sentiment": "neutral"}
{"author": "RealDealAxelrod", "timestamp": "2020-06-19T06:04:500Z", "status": "Liberals moved on to DACA... BLM can go back home and get ready for 2024", "sentiment": "positive"}
{"author": "ayemrdee", "timestamp": "2020-06-19T06:09:470Z", "status": "I wanna make a thread with a few resources to help DACA applicants complete their renewals on their own.", "sentiment": "positive"}
{"author": "kausmickey", "timestamp": "2020-06-19T06:12:390Z", "status": "Pretty good short order analysis of Roberts' DACA opinion ", "sentiment": "positive"}
{"author": "washingtonpost", "timestamp": "2020-06-19T06:22:310Z", "status": "Opinion: The DACA decision chalks up another triumph for the rule of law ", "sentiment": "positive"}
{"author": "Burquevibes", "timestamp": "2020-06-19T06:24:230Z", "status": "If you’re so open about supporting DACA students then give them financial support since they did not receive money from the CARES act through LMU. Or is this just performative activism? ", "sentiment": "positive"}
{"author": "immig_rant", "timestamp": "2020-06-19T06:53:190Z", "status": "One thing remains clear: they would have struck daca down were it not for the ongoing uprisings against anti-black state violence.", "sentiment": "negative"}
{"author": "zripena", "timestamp": "2020-06-19T06:54:340Z", "status": "Fuck a DACA, give me a PS5", "sentiment": "negative"}
{"author": "Astrid_NV", "timestamp": "2020-06-19T06:55:060Z", "status": "I’m so appreciative of the love & support that surrounds me, but I’m even more grateful for @Norma_LRM and the 10 other plaintiffs on this #DACA #SCOTUS case that were brave enough to challenge the Trump Administration. That is where the true courage lies. Always, Dream Big!", "sentiment": "positive"}
{"author": "zripena", "timestamp": "2020-06-19T07:00:080Z", "status": "It's important to highlight this point because I know many DREAMers are so into being the good immigrant that they most likely wouldn't have protested if the decision went the other way. Fuvk a DACA, we need to work towards abolition. ", "sentiment": "positive"}
{"author": "donaldrusso994", "timestamp": "2020-06-19T07:01:340Z", "status": "Yes. SCOTUS obviously want to screw over @POTUS with its DACA abomination; but the unintended consequence of Roberts' hatred of @realDonaldTrump is that executive orders are now impossible to challenge in court", "sentiment": "negative"}
{"author": "heretosaveday07", "timestamp": "2020-06-19T07:10:160Z", "status": "The recent Supreme Court decisions, not only on DACA, Sanctuary Cities, Census, and others, tell you only one thing, we need NEW JUSTICES of the Supreme Court. Cotton blasts Roberts over DACA, invites him to resign, run for office | Fox News ", "sentiment": "positive"}
{"author": "RevoltRollin", "timestamp": "2020-06-19T07:12:120Z", "status": "Every president has done those things but he signed DACA so he protected a lot of immigrants from all countries... there was a duality to Obama’s presidency that’s missing in a lot of others he’s far from our worst president and way closer to being one of our best.", "sentiment": "positive"}
{"author": "NBCNews", "timestamp": "2020-06-19T07:34:030Z", "status": "US Supreme Court Justice Sotomayor drew a clear line between President Trump’s history of remarks against Mexicans and immigrants and the admin.'s position on DACA. https://nbcnews.to/2YeWzen", "sentiment": "positive"}
{"author": "ABC", "timestamp": "2020-06-19T07:38:000Z", "status": "DACA is safe—for now. @FiveThirtyEight on what could happen next:", "sentiment": "neutral"}
{"author": "mitchsnyder45", "timestamp": "2020-06-19T07:48:200Z", "status": "Could the SCOTUS decision on DACA work in President Trump's favor regarding election integrity? Couldn't @realDonaldTrump issue an Executive Order which prohibits mail-in voting and ballot harvesting? (Keep absentee voting) No need for legislation now, right? @RichSementa", "sentiment": "positive"}
{"author": "SaraCarterDC", "timestamp": "2020-06-19T08:00:000Z", "status": "#SCOTUS Rules Trump Admin's Plan To End #DACA Illegal. Here's What You Need To Know. https://saraacarter.com/scotus-rules-trump-admins-plan-to-end-daca-illegal-heres-what-you-need-to-know/?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=social-pug via @SaraCarterDC", "sentiment": "negative"}
{"author": "MSNBC", "timestamp": "2020-06-19T08:00:100Z", "status": "California AG Becerra on the US Supreme Court DACA decision: “It’s one of those cases where I think all of us can take a big sigh of relief believing that maybe the rule of law still exists in this country, even with Donald Trump in the White House.” https://on.msnbc.com/3efSwnx", "sentiment": "positive"}
{"author": "COsweda", "timestamp": "2020-06-19T08:02:270Z", "status": "ADDENDUM: SEE? @realDonaldTrump GETS IT. Supreme Court ruling on DACA makes the president into an ABSOLUTE DICTATOR. John Roberts wrote that ALL ILLEGAL PRESIDENTIAL ORDERS MUST BE OBEYED. Roberts changed the rule of law into the rule of president. ", "sentiment": "negative"}
{"author": "omgmathews1", "timestamp": "2020-06-19T08:03:090Z", "status": "Honestly I cannot wait for Trump to rewrite that DACA order and send these entitled brats home. I bet they find a new found love for America when their ignorant asses find themselves in their 3rd world nations hell.", "sentiment": "positive"}
{"author": "DailyCaller", "timestamp": "2020-06-19T08:15:030Z", "status": "‘I Invite Him To Resign’: Senator Tom Cotton Rips John Roberts, Supreme Court Over DACA Decision ", "sentiment": "positive"}
{"author": "CNBC", "timestamp": "2020-06-19T08:45:420Z", "status": "Apple CEO Tim Cook praised the Supreme Court’s ruling that keeps in place the Obama-era immigration program known as DACA. ", "sentiment": "positive"}
{"author": "18hariprakash18", "timestamp": "2020-06-19T08:46:030Z", "status": "Its black and white DACA is an illegal paper by Obama and Robert's cared more about his dislike for trump then law..Roberts also passed obamacare..Hes unfair in that position.Trump must win must put more judges in to stop pol weaponizing SC ", "sentiment": "negative"}
{"author": "TIME", "timestamp": "2020-06-19T09:01:560Z", "status": "\"There's hope for us.\" DACA recipients celebrate Supreme Court ruling, but say there's more work to do ", "sentiment": "positive"}
{"author": "actualJohnTKirk", "timestamp": "2020-06-19T09:14:460Z", "status": "I hope Americans realize what SCOTUS' (Roberts') decision on DACA boils down to: It's legal if Obama did it. It's illegal if Trump does it. I see a significant problem here...", "sentiment": "negative"}
{"author": "MSNBC", "timestamp": "2020-06-19T09:38:040Z", "status": "Neal Katyal on President Trump's comments on DACA ruling: \"The idea that a President of the U.S. would accuse ... a co-equal branch of government or ruling just because they don't like him demonstrates just how much this guy is unfit for office.\" https://on.msnbc.com/3ehbHxg", "sentiment": "negative"}
{"author": "alfonslopeztena", "timestamp": "2020-06-19T09:58:200Z", "status": "Right now Trump is a grounded vessel, trapped by covid-19, by the social justice movement, by the Supreme Court saying he circumvented the law to deport 800,000 DACA Dreamers, and by Bolton saying that he’s an idiot By @PhilipRucker", "sentiment": "positive"}
{"author": "scarylawyerguy", "timestamp": "2020-06-19T10:01:040Z", "status": "Lots of reporting missing the forest for the trees in the SCOTUS DACA decision - Court didn't say Trump couldn't get rid of DACA; it said he has to follow basic administrative procedures b4 doing so. Give him a 2d term &amp; mildly competent people, and SCOTUS goes 5-4 the other way ", "sentiment": "neutral"}
{"author": "3TW_3470", "timestamp": "2020-06-19T10:02:020Z", "status": "\"#SCOTUS Did NOT Rule That #DACA Is Here To Stay. It did not rule on the constitutionality of the program. This ruling was purely a procedural ruling and not a judgment of policy.\" ", "sentiment": "neutral"}
{"author": "Toneman807", "timestamp": "2020-06-19T10:10:400Z", "status": "Supreme court blocks Trump from ending DACA. I don’t know about the rest of you, but this is a big fucking deal. The Supreme Court broke the law by allowing this to continue. It’s unconstitutional, &amp; gives incentive to enter illegally. You have to earn the right to be an American", "sentiment": "positive"}
{"author": "KarluskaP", "timestamp": "2020-06-19T10:11:320Z", "status": "Cotton blasts Roberts over DACA, invites him to resign, run for office- ", "sentiment": "negative"}
{"author": "AP", "timestamp": "2020-06-19T10:12:360Z", "status": "From AP Morning Wire: • Juneteenth: A day of joy and pain, now US national action. • Atlanta police call out sick to protest murder charges. • Decline in US virus deaths may reverse; India cases soar. • Court rejects Trump bid to end DACA. SIGN UP: http://apnews.com/newsletter", "sentiment": "negative"}
{"author": "Avenger2Toxic", "timestamp": "2020-06-19T10:21:470Z", "status": "DACA is illegal. But our SC blocked our President form ending it. The justices that voted to block are criminals.", "sentiment": "negative"}
{"author": "newsmax", "timestamp": "2020-06-19T10:30:500Z", "status": "Justice Thomas rips into colleagues for blocking Trump's request to end DACA protections, \"Today’s decision must be recognized for what it is: an effort to avoid a politically controversial but legally correct decision.\" http://ow.ly/JKsD50AbF91", "sentiment": "neutral"}
{"author": "almostjingo", "timestamp": "2020-06-19T10:39:060Z", "status": "Anyone celebrating SCOTUS DACA ruling is drunk (looking at you @SpeakerPelosi) the decision was based on procedure (petty AF) but they pretty much said if it’s filed correctly, DACA is over, you have nothing to be proud about Nancy. Congress needs to pass immigration reform.", "sentiment": "positive"}
{"author": "almostjingo", "timestamp": "2020-06-19T10:41:060Z", "status": "DACA recipients are still in limbo because Democrats and Republicans want to campaign on immigration not fix it, they’ve been promising immigration reform for decades. Eunuchs.", "sentiment": "positive"}
{"author": "sandycrook8", "timestamp": "2020-06-19T10:45:080Z", "status": "Trump would love for the legislative branch to do their job and put forth a bill that would resolve the illegal EO DACA. The media will never tell it’s viewers this.", "sentiment": "positive"}
{"author": "almostjingo", "timestamp": "2020-06-19T10:45:210Z", "status": "Did you know DACA recipients aren’t allowed to become citizens? That’s whacked.", "sentiment": "neutral"}
{"author": "JennaEllisEsq", "timestamp": "2020-06-19T10:54:130Z", "status": "The DACA decision from SCOTUS was legally absurd. This wasn’t about the law or the Constitution, it was about attacking one person — President @realDonaldTrump. The majority is moving the constitutional law goal posts for EOs in a way that the separation of powers forbids. ", "sentiment": "negative"}
{"author": "CBSNews", "timestamp": "2020-06-19T10:55:110Z", "status": "Dreamers rejoice. Coming up on @CBSThisMorning, hear from young immigrants celebrating the Supreme Court decision supporting the DACA program, allowing them to stay in the U.S. ", "sentiment": "positive"}
{"author": "jsolomonReports", "timestamp": "2020-06-19T10:59:050Z", "status": "Supreme Court ruling rejecting Trump on DACA ‘a very minor decision,’ Dershowitz says | Just The News ", "sentiment": "positive"}
{"author": "NewDay", "timestamp": "2020-06-19T11:02:450Z", "status": "“The Trump administration just simply pushed too hard to go too quickly to the right for Chief Justice Roberts,” @JeffreyToobin says on the Supreme Court rulings on DACA and LGBTQ workers’ rights this week. Roberts “is not going to be pushed around by this administration.” ", "sentiment": "positive"}
{"author": "ThePlumLineGS", "timestamp": "2020-06-19T11:10:470Z", "status": "Dreamers themselves deserve immense credit for their SCOTUS win. Because their tenacious organizing made their cause so popular, Trump never wanted to own the decision to end DACA. So he took coward's way out: Blame Obama. That led straight to his loss. ", "sentiment": "positive"}
{"author": "123RHGreen", "timestamp": "2020-06-19T11:13:540Z", "status": "‘I Invite Him To Resign’: Tom Cotton Rips John Roberts, Supreme Court Over DACA Decision https://dailycaller.com/2020/06/18/tom-cotton-daca-john-roberts-supreme-court/ via @dailycaller", "sentiment": "positive"}
{"author": "SenTomCotton", "timestamp": "2020-06-19T11:16:330Z", "status": "Last night I joined @seanhannity to discuss the Supreme Court's DACA decision. WATCH: ", "sentiment": "positive"}
{"author": "TODAYshow", "timestamp": "2020-06-19T11:20:170Z", "status": "In a blow to President Trump, the Supreme Court blocked an effort to end the DACA program. Now the decision is being celebrated by hundreds of thousands of undocumented immigrants known as “Dreamers.” @gabegutierrez has more.", "sentiment": "positive"}
{"author": "crampell", "timestamp": "2020-06-19T11:28:070Z", "status": "Trump’s immigration policies are not only legally dubious, economically unwise & morally abhorrent. They’re also *really* unpopular. That’s especially true of his efforts to terminate DACA. Whether or not he knows it, SCOTUS just did him a massive favor ", "sentiment": "positive"}
{"author": "barbara_1965", "timestamp": "2020-06-19T11:39:070Z", "status": "So, let me get this straight @realDonaldTrump and @GOP You want to get rid of DACA kids, yet you are cool with birther tourism? Instant citizens when Russian, Chinese etc nationals pop into the country, have their kids to allow lifelong benefit without contribution. ", "sentiment": "positive"}
{"author": "CBSThisMorning", "timestamp": "2020-06-19T11:40:380Z", "status": "While DACA supporters celebrated outside the Supreme Court yesterday, many so-called \"Dreamers\" acknowledge there will be more legal battles to stay in the U.S. @MariaESalinas spoke to “Dreamers” who are celebrating and continuing to fight for a permanent solution.", "sentiment": "positive"}
{"author": "FarrellGabriell", "timestamp": "2020-06-19T11:40:460Z", "status": "What a week...SCOTUS protected LGBTQ workers from discrimination in the workplace & DACA recipients from immediate deportation. Garrett Rolfe &amp; Devin Brosnan were charged with felony murder. And more people than ever now know what Juneteenth stands for. I’m cautiously hopeful.", "sentiment": "negative"}
{"author": "lawrencehurley", "timestamp": "2020-06-19T11:48:560Z", "status": "Trump has lost two huge Supreme Court cases on technicalities in the last year: DACA &amp; census. They are just the latest examples of what legal experts have said is a sloppy approach to boring legal process that has cost the administration dearly More: ", "sentiment": "positive"}
{"author": "m_keenum", "timestamp": "2020-06-19T11:50:530Z", "status": "If you’re a DACA dreamer and you’re not for pledging allegiance to a flag or serving this country-I’m not for you being a citizen. DACA Felons? Gone. DACA Rioters? Gone. You don’t get to enjoy the rights in the country if you don’t obey the law. You have no 1st Amendment rights.", "sentiment": "positive"}
{"author": "Blackdi51264299", "timestamp": "2020-06-19T11:54:590Z", "status": " The SCOTUS allows a Dem President to violate the constitution and denies a Rep President his constitutional authority to rescind! #WakeupAmerica Acting DHS chief responds to 'very troubling' Supreme Court DACA ruling, says program 'clearly unlawful' ", "sentiment": "negative"}
{"author": "allinwithchris", "timestamp": "2020-06-19T12:00:010Z", "status": "DACA lawyer Xavier Becerra on SCOTUS decision: “It’s one of those cases where I think all of us can take a big sigh of relief believing that maybe the rule of law still exists in this country, even with Donald Trump in the White House.” http://on.msnbc.com/3fE7G6a #inners", "sentiment": "positive"}
{"author": "KrisKobach1787", "timestamp": "2020-06-19T12:02:250Z", "status": "The bad news for immigration law enforcement is that it will take a long time to complete the task. As the attorney who first challenged the DACA amnesty in the summer of 2012 representing 10 ICE agents, I can say with certainty that DACA was illegal from its inception.", "sentiment": "negative"}
{"author": "KrisKobach1787", "timestamp": "2020-06-19T12:02:250Z", "status": "The five justice majority on the Supreme Court made a mockery of the law yesterday in their DACA decision. The good news is that all nine justices agree the Trump administration can cancel DACA.", "sentiment": "positive"}
{"author": "RightWingLawMan", "timestamp": "2020-06-19T12:02:480Z", "status": "If you're aware DACA was unconstitutional to begin with, retweet this for me... ", "sentiment": "neutral"}
{"author": "RedState", "timestamp": "2020-06-19T12:04:000Z", "status": "The Supreme Court Rules Trump Can't End the Illegal DACA Program Because Nothing Matters Anymore ", "sentiment": "positive"}
{"author": "thehill", "timestamp": "2020-06-19T12:13:060Z", "status": "Obama calls for voters to elect Biden in praising Supreme Court's DACA decision http://hill.cm/Fp1zqjz", "sentiment": "positive"}
{"author": "PaleRider_1776", "timestamp": "2020-06-19T12:16:470Z", "status": "The SCOTUS decision on DACA doesn’t change the fact that it’s illegal! President Trump will start the elimination process all over again. https://www.breitbart.com/politics/2020/06/18/donald-trump-to-end-daca-again-we-have-to-start-process-over/", "sentiment": "negative"}
{"author": "riacton", "timestamp": "2020-06-19T12:18:390Z", "status": "And has positive effects on their U.S. citizen peers! \"Does Peer Motivation Impact Educational Investments? Evidence from DACA\" by @BrianaBallis https://brianaballis.weebly.com/uploads/4/0/3/9/40392931/daca_spillovers_-_1-2-19.pdf", "sentiment": "positive"}
{"author": "ishapiro", "timestamp": "2020-06-19T12:23:170Z", "status": "\"As is often the case with a Roberts opinion, an attempt to depoliticize an issue or remove the Supreme Court from the electoral fray only does the opposite.\" My latest on the DACA ruling @FDRLST #catoscotus", "sentiment": "positive"}
{"author": "democracynow", "timestamp": "2020-06-19T12:25:400Z", "status": "The Supreme Court has ruled against the Trump administration's attempt to end DACA, which protects nearly 700,000 immigrants from deportation. \"It reminded me of what got us DACA to begin with, which was a sustained pressure of activism,\" says @ImmAdvocacy's @LCortesRomero.", "sentiment": "positive"}
{"author": "EtheElephant1", "timestamp": "2020-06-19T12:26:280Z", "status": "#ELEPHANTNATION POLL OF THE WEEKEND Do You think the SCOTUS BLOCKING @realDonaldTrump bid to end DACA was the correct decision and why? FOLLOW US and LEARN! We Report the TRUTH! #WeAreTheNewsNow @EtheElephant1 #MAGA #KAG #OBAMAGATE", "sentiment": "negative"}
{"author": "altrobertalt", "timestamp": "2020-06-19T12:28:060Z", "status": "If DACA is illegal why can’t chief justice Roberts uphold the law now as opposed to after November? It is not the supreme courts role to enforce regulatory checks. He did the Democrats a big favor! Is Roberts compromised? He was on the Epstein Island flight log so there’s that. ", "sentiment": "negative"}
{"author": "Grei_sa", "timestamp": "2020-06-19T12:30:310Z", "status": "To celebrate a DACA victory yesterday also means waking up today in defense of Black Lives. Following &amp; flanking Black leadership bc THAT’S how we won DACA in the first place, the example set forth by Black visionaries that demanded dignity.", "sentiment": "positive"}
{"author": "democracynow", "timestamp": "2020-06-19T12:31:070Z", "status": "\"It didn't work out for him,\" @ErikaAndiola of @RAICESTEXAS says of Trump's attempt to end DACA, blocked by the Supreme Court Thursday. \"What he wanted to do was to use DACA recipients as a bargaining chip to try to get his anti-immigrant agenda enacted.\" ", "sentiment": "positive"}
{"author": "PsychoMetalHed", "timestamp": "2020-06-19T12:34:520Z", "status": "Good! Dig in, boss! Donald Trump to End DACA Again: ‘We Have to Start Process Over‘ https://www.breitbart.com/politics/2020/06/18/donald-trump-to-end-daca-again-we-have-to-start-process-over/ via @BreitbartNews", "sentiment": "positive"}
{"author": "DrShayPhD", "timestamp": "2020-06-19T12:36:460Z", "status": "Remember I said the same thing? Said that the DACA ruling gave President Trump latitude to write his own laws? Well, here it is. ", "sentiment": "positive"}
{"author": "hrkbenowen", "timestamp": "2020-06-19T12:38:220Z", "status": "‘I Invite Him To Resign’: Tom Cotton Rips John Roberts, Supreme Court Over DACA Decision ", "sentiment": "positive"}
{"author": "AKA_RealDirty", "timestamp": "2020-06-19T12:40:250Z", "status": "DACA Recipient is it happy about the supreme court ruling. He says @realDonaldTrump Was trying to make Congress do their job. He wasn’t just trying to ship everyone back. pic.twitter.com/lVuUYGJtn6", "sentiment": "positive"}
{"author": "FoxFriendsFirst", "timestamp": "2020-06-19T12:50:030Z", "status": "President Trump sounds off on the Supreme Court’s “horrible and politically charged” DACA decision. @JennaEllisEsq explains why this ruling could be one of the worst legal missteps we’ve seen from this SCOTUS class.", "sentiment": "neutral"}
{"author": "MissILmom", "timestamp": "2020-06-19T12:59:310Z", "status": "@SenTomCotton is Awesome! Justice Roberts is #ProofPositive that #LyingLiberalLeftists have Indeed Infiltrated our Courts. This #EvilElitist Should be Impeached! #SCOTUSfail Cotton blasts Roberts over DACA, invites him to resign, run for office https://fxn.ws/2CnwSj9 #FoxNews", "sentiment": "positive"}
{"author": "EdwardTHardy", "timestamp": "2020-06-19T13:00:000Z", "status": "Chief Justice John Roberts has now sided with the liberal justices to support the Affordable Care Act, DACA and LGBT+ rights", "sentiment": "positive"}
{"author": "realDonaldTrump", "timestamp": "2020-06-19T13:14:130Z", "status": "The Supreme Court asked us to resubmit on DACA, nothing was lost or won. They “punted”, much like in a football game (where hopefully they would stand for our great American Flag). We will be submitting enhanced papers shortly in order to properly fulfil the Supreme Court’s.....", "sentiment": "positive"}
{"author": "realDonaldTrump", "timestamp": "2020-06-19T13:14:140Z", "status": "...ruling & request of yesterday. I have wanted to take care of DACA recipients better than the Do Nothing Democrats, but for two years they refused to negotiate - They have abandoned DACA. Based on the decision the Dems can’t make DACA citizens. They gained nothing! @DHSgov", "sentiment": "negative"}
{"author": "ChrisJZullo", "timestamp": "2020-06-19T13:15:290Z", "status": "Who does Donald Trump think he’s kidding. His fault DACA is a mess. He’s the one who created that mess. Fix the system. Stop VISA abuse, increase all quotas. Need more judges in more courts. End family separations. Secure the border with technology and steel slates", "sentiment": "negative"}
{"author": "davidmweissman", "timestamp": "2020-06-19T13:15:360Z", "status": "First thing you tweet about on #JuneteenthDay is your loss on DACA. You wonder why the black community thinks you are racist.", "sentiment": "negative"}
{"author": "AndyOstroy", "timestamp": "2020-06-19T13:15:520Z", "status": "You LOST, you gaslighting buffoon.... #DACA", "sentiment": "negative"}
{"author": "HKrassenstein", "timestamp": "2020-06-19T13:16:240Z", "status": "So Trump wants to \"take care of DACA\" by kicking Dreamers out of America. That's how far this country has fallen.", "sentiment": "positive"}
{"author": "Pappiness", "timestamp": "2020-06-19T13:16:290Z", "status": "75% of voters support DACA, but Trump keeps trying. He doesn't know how to walk away from a loss. That's probably why he's been bankrupt so many times.", "sentiment": "negative"}
{"author": "HKrassenstein", "timestamp": "2020-06-19T13:19:040Z", "status": "Just to be clear, Joe Biden said he will sign papers on the first day he takes office, in order to allow DACA recipients to stay in America. You call that \"abandoning DACA?\"", "sentiment": "positive"}
{"author": "dvillella", "timestamp": "2020-06-19T13:20:230Z", "status": "WRONG! The Democrats passed a DACA bill a YEAR ago that #MoscowMitch, the #GrimReaper, refuses to take up. Call Mitch!", "sentiment": "negative"}
{"author": "dvillella", "timestamp": "2020-06-19T13:22:000Z", "status": "Can you sign an Executive Order making DACA recipients U.S. citizens? What have YOU done in the past 3 1/2 years to protect them, Mr. I Alone Can Fix It?", "sentiment": "positive"}
{"author": "Patiepot27", "timestamp": "2020-06-19T13:22:420Z", "status": "It’s #HughDancy’s Bday! I’ve donated to Progress21 which helps Dreamers pay for DACA renewal fees, and to Black Lives Matter https://21progress.org/ https://blacklivesmatter.com/ #HappyBirthdayHughDancy ", "sentiment": "positive"}
{"author": "CristobalJAlex", "timestamp": "2020-06-19T13:25:150Z", "status": "Proud of DACA recipients. Proud of the fearless advocates who fought so hard for this. And proud of my boss who stands with Dreamers. “The county needs you. Home is here.” ", "sentiment": "positive"}
{"author": "SexCounseling", "timestamp": "2020-06-19T13:25:480Z", "status": "Pelosi had many chances to take care of DACA and refused to negotiate, yet they continue to blame Trump for her failure to act!", "sentiment": "negative"}
{"author": "jwgop", "timestamp": "2020-06-19T13:26:520Z", "status": "Haters gonna hate. @realDonaldTrump doubles down on DACA kids. ", "sentiment": "negative"}
{"author": "rightNtruthMat", "timestamp": "2020-06-19T13:28:140Z", "status": "Trump is Melting Down SCOTUS, DACA, LGBTQ Bolton, Mary Trump Bad Polling Bible Bust Hiding an illness anti-Trump protests Impotence = 120K deaths Generals, NFL, NASCAR Mocked by foreign leaders Trump is profoundly Unfit to serve as #POTUS #WeakPresident", "sentiment": "negative"}
{"author": "TheRightMelissa", "timestamp": "2020-06-19T13:30:570Z", "status": "Everyone knows Obama’s executive order on DACA (whether you like it or not) is unconstitutional Everyone knows an executive order can be nullified by the next president (like it or not) So the Supreme Court ruling was a sign of how lawlessness is creeping into our institutions", "sentiment": "positive"}
{"author": "SexCounseling", "timestamp": "2020-06-19T13:31:330Z", "status": "President Trump said over and over again that he wanted to negotiate for DACA but Pelosi turned him down every time!", "sentiment": "neutral"}
{"author": "Yamiche", "timestamp": "2020-06-19T13:34:320Z", "status": "President Trump says the federal government will be resubmitting papers on DACA. ", "sentiment": "neutral"}
{"author": "TUSK81", "timestamp": "2020-06-19T13:38:570Z", "status": "Your regular reminder that House Democrats passed legislation putting #DACA recipients onto a path to legalization and citizenship OVER A YEAR AGO.", "sentiment": "neutral"}
{"author": "neeratanden", "timestamp": "2020-06-19T13:44:400Z", "status": "For all the people falling for the spin that the Supreme Court decision was a win for him because he didn’t really want to do DACA anyway. ", "sentiment": "positive"}
{"author": "SCOTUSblog", "timestamp": "2020-06-19T13:44:420Z", "status": "#SCOTUSlinkoftheday: @GregStohr reports that although recent losses at #SCOTUS \"left [President Donald] Trump seething,\" yesterday's #DACA \"decision suggested it was Trump’s penchant for short-cuts, rather than any personal animus, that led him to defeat\" ", "sentiment": "negative"}
{"author": "ianbremmer", "timestamp": "2020-06-19T13:45:000Z", "status": "Trump vs. Supreme Court #DACA (by Sousa &amp; Machado) ", "sentiment": "positive"}
{"author": "michellemalkin", "timestamp": "2020-06-19T13:45:560Z", "status": "You should abandon DACA. Take care of Americans first. ", "sentiment": "positive"}
{"author": "JuanSaaa", "timestamp": "2020-06-19T13:49:220Z", "status": "This dude appointed 2 ultra conservatives to #SCOTUS and still lost on #DACA Instead of taking the L and walking away, he’s about to DOUBLE DOWN on his effort to deport #DACA recipients If Trump wanted to treat Dreamers with heart, then he’d stop listening to Stephen Miller ", "sentiment": "positive"}
{"author": "MariaBartiromo", "timestamp": "2020-06-19T13:50:040Z", "status": "Supreme Court dismisses White House attempt to end DACA http://ow.ly/xasE30qRADB @MorningsMaria @FoxBusiness", "sentiment": "positive"}
{"author": "michellemalkin", "timestamp": "2020-06-19T13:52:300Z", "status": "Coming up on Newsmax 10:05am Eastern to talk DACA &amp; China. Then #MalkinLive on my YouTube channel &amp; here at 11am Eastern w/@MarkSKrikorian to talk DACA, #ExpandTheBan &amp; 20 Actions @realdonaldtrump must take to Reduce Work Visas and Permits", "sentiment": "neutral"}
{"author": "leedsgarcia", "timestamp": "2020-06-19T13:57:330Z", "status": "You’re a liar and accept the loss & move on. If you rescind DACA again because you hate Dreamers that badly, we will beat you again. ", "sentiment": "negative"}
{"author": "ABC7", "timestamp": "2020-06-19T13:58:490Z", "status": "#BREAKING Trump renews efforts to end legal protections for 650,000 young immigrants under #DACA program after Supreme Court blocked first try ", "sentiment": "positive"}
{"author": "votolatino", "timestamp": "2020-06-19T14:00:420Z", "status": "Justice Sotomayor called out her colleagues for not acknowledging the explicit racism in Trump's decision to end DACA. Remember, he referred to immigrants as \"animals\" and \"criminals\". https://www.nbcnews.com/news/latino/justice-sotomayor-cites-trump-s-remarks-against-mexicans-immigrants-behind-n1231494", "sentiment": "negative"}
{"author": "crampell", "timestamp": "2020-06-19T14:03:310Z", "status": "Terminating DACA *has* gotten a ton of media attention though, a credit to Dreamers &amp; their allies, who have organized, mobilized, told their stories. Americans support them. House passed bill protecting them. And yet Trump remains hell-bent on punishing these young immigrants ", "sentiment": "positive"}
{"author": "heatherjones333", "timestamp": "2020-06-19T14:05:530Z", "status": "Yeah John, run for office if you want to play politics. Don't destroy the Constitution. Cotton blasts Roberts over DACA, invites him to resign, run for office ", "sentiment": "positive"}
{"author": "davidharsanyi", "timestamp": "2020-06-19T14:07:030Z", "status": "icymi - DACA is illegal. It doesn’t matter if it's popular ", "sentiment": "negative"}
{"author": "emeriticus", "timestamp": "2020-06-19T14:09:540Z", "status": "DACA recipients are far from the \"best and brightest.\" The administration should refuse to renew legal protection for any DACA beneficiaries as their deferral periods end and reject an amnesty deal going forward. My article in Townhall: ", "sentiment": "positive"}
{"author": "EpochTimes", "timestamp": "2020-06-19T14:10:040Z", "status": "President Donald Trump decried the #SupremeCourt’s decision to reject his bid to end #DACA, saying they have to “start this process all over again” for a legal solution. He said that he will seek a “legal solution on DACA, not a political one.” ", "sentiment": "positive"}
{"author": "cathleendecker", "timestamp": "2020-06-19T14:11:040Z", "status": "Before 10 a.m., the president has threatened protesters and, separately, announced via tweet that the administration will try again to deport DACA recipients, including in that message a dig at kneeling during football games. No tweets about Juneteenth.", "sentiment": "negative"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T14:14:220Z", "status": "The list goes on... Black immigrants make up a substantial number of #DACA recipients. Almost 30% of the families detained at Karnes Detention Center over the last 6 months have been Haitian. Hundreds of African migrants are stuck at the U.S.- Mexican border.", "sentiment": "negative"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T14:14:250Z", "status": "This is a critical time to show up in defense of ALL Black Lives: Afro-Latinx, Black immigrants, Black trans folks, Black refugees, Black DACA recipients...etc. Join @Mvmnt4BlkLives #SixNineteen call to action to mobilize digitally &amp; in our communities.", "sentiment": "positive"}
{"author": "TUSK81", "timestamp": "2020-06-19T14:14:340Z", "status": "Sonia Sotomayor was the sole justice to point out Trump's racist remarks against Mexicans, immigrants behind his decision to end #DACA: ", "sentiment": "negative"}
{"author": "WSJ", "timestamp": "2020-06-19T14:15:090Z", "status": "From @WSJopinion: The DACA ruling is an invitation for executive mischief, especially by Presidents at the end of their terms, writes The Editorial Board ", "sentiment": "negative"}
{"author": "RevJenButler", "timestamp": "2020-06-19T14:16:280Z", "status": "Faith leaders calling for passage of Dream & Promise Act. We celebrate the decision to keep #DACA and protect young immigrants, but work continues for permanent solutions and protections for all immigrants. @FaithPublicLife", "sentiment": "positive"}
{"author": "Ih8uJ", "timestamp": "2020-06-19T14:18:210Z", "status": "Democrats believe that DACA kids shouldn’t have to pay for their parents crimes. While holding white people responsible for 17 century slave owners. #LiberalLogic", "sentiment": "positive"}
{"author": "ClaremontInst", "timestamp": "2020-06-19T14:19:130Z", "status": "As the media declares the #DACA fight over following the ruling by the Supreme Court, Claremont Institute Senior Fellow @DrJohnEastman discusses why the media should wait before breaking out the victory champagne as well as Trump's path moving forward on The @IngrahamAngle.", "sentiment": "positive"}
{"author": "ajplus", "timestamp": "2020-06-19T14:19:170Z", "status": "BREAKING: President Trump says he will try to repeal DACA again, after the Supreme Court rejected his first attempt. DACA protects about 700,000 young people from deportation and is supported by 3/4 of voters. ", "sentiment": "positive"}
{"author": "rightNtruthMat", "timestamp": "2020-06-19T14:22:540Z", "status": "Trump is Melting Down SCOTUS, DACA, LGBTQ Bolton, Mary Trump Bad Polling Bible Bust Hiding an illness anti-Trump protests Impotence = 120K deaths Generals, NFL, NASCAR Mocked by foreign leaders Trump is profoundly Unfit to serve as #POTUS #WeakPresident", "sentiment": "negative"}
{"author": "JackFell13", "timestamp": "2020-06-19T14:24:430Z", "status": "So let me get this straight, orange rodeo clown. You want to end DACA... but you want to keep them here? What's the point?!? What the hell happened to build the wall, deport them all? You can't be this stupid. ", "sentiment": "negative"}
{"author": "AlanZarembo", "timestamp": "2020-06-19T14:28:130Z", "status": "More than 27,000 DACA recipients work in healthcare, many of them on the frontlines of the coronavirus pandemic. Great piece by ⁦@kurtisalee⁩ ⁦⁦@VanessaMartinez⁩ ⁦@latimes⁩", "sentiment": "positive"}
{"author": "WayneDupreeShow", "timestamp": "2020-06-19T14:30:400Z", "status": "Even Obama knew his DACA executive order was pure hogwash - here he is in his OWN words. ", "sentiment": "neutral"}
{"author": "latimes", "timestamp": "2020-06-19T14:33:010Z", "status": "Essential California: DACA stands, for now ", "sentiment": "neutral"}
{"author": "hrkbenowen", "timestamp": "2020-06-19T14:37:210Z", "status": "Clarence Thomas Condemns the 'Timid' DACA Decision in a Scathing Dissent ", "sentiment": "negative"}
{"author": "CongressmanHice", "timestamp": "2020-06-19T14:40:240Z", "status": "Let's be clear... If Democrats truly cared about DACA recipients, we could have settled their status years ago. @realDonaldTrump has repeatedly tried to reasonably negotiate — border security for legal status. Democrats want to keep DACA as a political weapon. ", "sentiment": "positive"}
{"author": "democracynow", "timestamp": "2020-06-19T14:41:000Z", "status": "Supreme Court Blocks Trump from Ending DACA in Victory for Immigrants ", "sentiment": "positive"}
{"author": "samstein", "timestamp": "2020-06-19T14:43:460Z", "status": "Perhaps the problem isn’t Trump’s tweeting but the incongruity between messaging and policies. He loves Dreamers but is trying to end DACA again He’s for protections for pre-existing conditions but is suing to end Obamacare He loves seniors but believes COVID will fade away", "sentiment": "positive"}
{"author": "colbertlateshow", "timestamp": "2020-06-19T14:44:530Z", "status": "- Supreme Court defends DACA - First Drafts has Father's Day cards - @Sifill_LDF speaks on what defunding the police looks like - @birbigs discusses his new book! #LSSC http://cbs.com/shows/the-late-show-with-stephen-colbert/video/DPo48uw_cJ9sJjz5vvu9jzzfEdYhUmIi/the-late-show-6-18-20-sherrilyn-ifill-mike-birbiglia-", "sentiment": "positive"}
{"author": "NCAGO", "timestamp": "2020-06-19T14:48:460Z", "status": "\"These are young people who were brought to the United States as young children, went to school here, work here, serve our nation in the armed forces, on the front lines in our hospitals with the COVID-19 pandemic.\" – AG @JoshStein_ on Dreamers and DACA ", "sentiment": "positive"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T14:51:110Z", "status": "#DACA UPDATE: As we expected, President 45 will waste no time to begin the attack on DACA recipients &amp; to try to use them as bargaining chips to enact his racist, anti-immigrant agenda. So what does this (typically angry, 8am on a Friday) tweet mean? ", "sentiment": "negative"}
{"author": "CraigRozniecki", "timestamp": "2020-06-19T14:56:510Z", "status": "\"John Roberts Repeatedly Corrected Brett Kavanaugh in DACA Opinion\" - ", "sentiment": "neutral"}
{"author": "kurtisalee", "timestamp": "2020-06-19T14:59:260Z", "status": "Karen Garcia is among 27,000 healthcare workers nationwide with #DACA protections. Many are on the frontlines fighting COVID-19. My story from Phoenix w/ @VanessaMartinez: https://www.latimes.com/world-nation/story/2020-06-18/nurse-karen-garcia-daca-covid-19-uncertainty", "sentiment": "negative"}
{"author": "RAICESTEXAS", "timestamp": "2020-06-19T15:00:020Z", "status": "Join us in the fight for #DACA Sign this petition and tell the Trump Admin &amp; Co.: Hands off DACA ", "sentiment": "negative"}
{"author": "GA_peach3102", "timestamp": "2020-06-19T15:00:520Z", "status": "Unlike Obama, who w/ a sticky note & pen made a law, Trump tried to do right by #DACA #SCOTUS recognized what Obama did was unlawful but decided to play political football during an election year &amp; ALIGN themselves w the LEFT on an issue that should’ve NEVER BEEN in THEIR COURT", "sentiment": "positive"}
{"author": "CattHarmony", "timestamp": "2020-06-19T15:16:400Z", "status": "SCOTUS agrees that Obama's DACA is unconstitutional, yet John Roberts joining in with 4 liberal judges block Trump admin from ending the unconstitutional DACA. John Roberts is disgraceful &amp; must resign! #ResignRoberts", "sentiment": "negative"}
{"author": "TheDemCoalition", "timestamp": "2020-06-19T15:20:000Z", "status": "FACT: 202,500 #DACA recipients are working as doctors, nurses and other essential employees to protect Americans as the country confronts COVID-19. But, the #RacistInChief wants them gone from the only country they have ever known. https://www.pbs.org/newshour/nation/trump-says-he-will-renew-effort-to-end-daca-protections", "sentiment": "positive"}
{"author": "santiagomayer_", "timestamp": "2020-06-19T15:22:010Z", "status": "Kind of fucked up that the Supreme Court's reason for not ending DACA wasn't because there is just no justifiable reason for taking away the right to work and study from a million people whose only wrongdoing is being an immigrant... It was because Trump skipped some steps", "sentiment": "negative"}
{"author": "washingtonpost", "timestamp": "2020-06-19T15:22:080Z", "status": "Trump intends to renew effort to end DACA protections ", "sentiment": "neutral"}
{"author": "obedmanuel", "timestamp": "2020-06-19T15:29:390Z", "status": "In case you're wondering, yes, I did cover City of Dallas' budget, the historic DACA ruling and now a new Dallas County order on COVID-19 all in the span of three days. ", "sentiment": "positive"}
{"author": "realTuckFrumper", "timestamp": "2020-06-19T15:35:220Z", "status": "Susan Collins, Who Voted Against DACA, Celebrates SCOTUS Dreamer Decision ", "sentiment": "positive"}
{"author": "NewsCloset", "timestamp": "2020-06-19T15:39:160Z", "status": "Ted Cruz gets it too. https://youtu.be/hZUJh5oDj-8 He called the DACA opinion disgraceful", "sentiment": "neutral"}
{"author": "mitchellvii", "timestamp": "2020-06-19T15:42:280Z", "status": "TAKE THAT ROBERTS! - Donald Trump Confirms: We‘ll Re-Cancel DACA ‘Shortly‘ https://www.breitbart.com/politics/2020/06/19/donald-trump-well-re-cancel-daca-shortly/ via @BreitbartNews", "sentiment": "neutral"}
{"author": "LarrySchweikart", "timestamp": "2020-06-19T15:43:320Z", "status": "1) More from Zen Master on the DACA ruling: \"SCOTUS didn't rule that DACA was lawful. There is a suit pending by a bunch of states to invalidate DACA. That suit is in the district court; the judge stayed a motion for summary judgment pending outcome of the DACA rescission case.", "sentiment": "neutral"}
{"author": "NYDailyNews", "timestamp": "2020-06-19T15:44:050Z", "status": "Trump will renew effort to end legal protections for young immigrants after Supreme Court blocked first try The high court ruled Trump improperly ended the DACA program. Chief Justice John Roberts joined the four liberal justices in the 5-4 majority. ", "sentiment": "positive"}
{"author": "LarrySchweikart", "timestamp": "2020-06-19T15:44:180Z", "status": "2) \"This ties back to mootness; that is, had the DACA rescission been upheld, the states' suit against DACA would've been moot because DACA would've been rescinded. Now, the states' suit is obviously not moot, as DACA remains in effect.\"", "sentiment": "neutral"}
{"author": "LarrySchweikart", "timestamp": "2020-06-19T15:44:560Z", "status": "3) My observation: Since the states' concerns have nothing to do with federal APA regs, their cases against DACA are entirely different.", "sentiment": "neutral"}
{"author": "prernaplal", "timestamp": "2020-06-19T15:45:360Z", "status": "Any of my lawyer friends in private practice want to help out with a free remote clinic for #DACA and advance parole once it’s available again? I anticipate having about 50-100 interested people especially in remote parts of the USA but we can help them virtually!", "sentiment": "positive"}
{"author": "AwakenedOutlaw", "timestamp": "2020-06-19T15:45:520Z", "status": "Obama's illegal EO will be overturned. It's only a matter of when and not if. Donald #Trump Confirms: We‘ll Re-Cancel #DACA ‘Shortly‘ ", "sentiment": "negative"}
{"author": "thehill", "timestamp": "2020-06-19T15:46:040Z", "status": "EXCLUSIVE: Immigration coalition calls for permanent solution to DACA http://hill.cm/136neQ6", "sentiment": "positive"}
{"author": "Deoliver47", "timestamp": "2020-06-19T15:46:370Z", "status": "Sonia Sotomayor was the lone justice to point out Trump's racist history in his move to DACA ", "sentiment": "negative"}
{"author": "RepDMP", "timestamp": "2020-06-19T15:50:030Z", "status": "With news that President Trump is again trying to end DACA, It’s more important than ever to pass permanent legislation to protect Dreamers. The @HispanicCaucus and I are calling on @senatemajldr McConnell to give us a vote on the Promise and Dream Act.", "sentiment": "positive"}
{"author": "AlyssaJennette", "timestamp": "2020-06-19T15:50:290Z", "status": "A while ago, I got a pass on a client’s Latinx neo-noir; the editor suggested that the book didn’t talk enough about DACA and immigration. Another suggestion: maybe the book should focus on a character who has to get jumped into one of the local gangs. ", "sentiment": "neutral"}
{"author": "rightNtruthMat", "timestamp": "2020-06-19T15:51:450Z", "status": "Trump is Melting Down SCOTUS, DACA, LGBTQ Bolton, Mary Trump Bad Polling Bible Bust Hiding an illness anti-Trump protests Impotence = 120K deaths Generals, NFL, NASCAR Mocked by foreign leaders Trump is profoundly Unfit to serve as #POTUS #WeakPresident", "sentiment": "negative"}
{"author": "JLPtalk", "timestamp": "2020-06-19T16:02:380Z", "status": "Rescind DACA! ", "sentiment": "neutral"}
{"author": "leedsgarcia", "timestamp": "2020-06-19T16:22:530Z", "status": ".@HomelandKen is so pathetic. You lost move on. #DACA recipients aren’t hostages in your dealmaking to slash immigration nor pawns in a political game. They are people with children, families, and jobs. Just leave them alone &amp; go back to your miserable white nationalist life.", "sentiment": "negative"}
{"author": "jtblogs", "timestamp": "2020-06-19T16:26:480Z", "status": "Donald Trump Confirms: We’ll Re-Cancel DACA ‘Shortly’ https://www.breitbart.com/politics/2020/06/19/donald-trump-well-re-cancel-daca-shortly/", "sentiment": "neutral"}
{"author": "TC1776", "timestamp": "2020-06-19T16:30:060Z", "status": "There is no law on DACA it was an executive order. They only apply to government . Not the rest of the country it’s was fabricated that it was for the rest of the country . DACA is not a law and can be thrown out by the the president. ", "sentiment": "negative"}
{"author": "thehill", "timestamp": "2020-06-19T16:34:080Z", "status": "Trump signals he will submit new paperwork to rescind DACA after Supreme Court decision http://hill.cm/I2UfvJf", "sentiment": "positive"}
{"author": "TheDirtyArtist", "timestamp": "2020-06-19T16:36:340Z", "status": "This confuses me. They work, they go to school, they pay their DACA fees every year, they pay taxes, they aren’t criminals......why does he hate these young people so much?", "sentiment": "negative"}
{"author": "newsmax", "timestamp": "2020-06-19T16:40:000Z", "status": "“What is the point of building 20 feet high walls stretched across the southern border if you continue to build magnets that induce people to come here illegally?” @michellemalkin comments the DACA decision. “It is time to rescind DACA, period.\" http://nws.mx/tv", "sentiment": "neutral"}
{"author": "politico", "timestamp": "2020-06-19T16:45:040Z", "status": "Undeterred by this week's Supreme Court ruling, Trump says he will renew his effort to end DACA protections ", "sentiment": "positive"}
{"author": "dailykos", "timestamp": "2020-06-19T16:46:140Z", "status": "Sonia Sotomayor was the lone justice to point out Trump's racist history in his move to end DACA ", "sentiment": "negative"}
{"author": "JudicialWatch", "timestamp": "2020-06-19T16:50:310Z", "status": ".@TomFitton will appear on “Lou Dobbs Tonight” on the Fox Business Network in the 5 pm hour ET tonight, June 19, to discuss the Supreme Court decision regarding President Trump's push to end DACA; former FBI Director Mueller and the DOJ being sued by businessman, and more! ", "sentiment": "positive"}
{"author": "PinkBelgium", "timestamp": "2020-06-19T16:53:350Z", "status": "I agree 1000% Mister President @realDonaldTrump! #JusticeRoberts will be complicit of electoral fraud! Millions and millions of illegals will vote #SleepyJoe. We must STOP this scandal #DACA #RIGGEDELECTION", "sentiment": "negative"}
{"author": "SenatorDurbin", "timestamp": "2020-06-19T16:53:390Z", "status": "Yesterday’s Supreme Court decision was historic, but it was just the first step. We need to ensure the protection of #DACA recipients and pass the House-passed American Dream and Promise Act. #HomeIsHere", "sentiment": "positive"}
{"author": "UNITEDWEDREAM", "timestamp": "2020-06-19T16:55:040Z", "status": "#DACA is #HereToStay! Today, join us for a conversation with @FWDus, @NILC, &amp; @UndocuBlack and as we break down yesterday’s historic #scotus decision, what it means for #DACA, and how folks can support. Join us TODAY @4pm ET at http://facebook.com/NILC #HomeIsHere", "sentiment": "positive"}
{"author": "FrankelJeremy", "timestamp": "2020-06-19T16:56:260Z", "status": "President Trump Will Renew Effort to End DACA Program ", "sentiment": "neutral"}
{"author": "SenSchumer", "timestamp": "2020-06-19T16:58:060Z", "status": "President Trump & Stephen Miller will stop at nothing Their \"arbitrary” and “capricious” DACA rule was overturned by the Supreme Court Now he’s throwing a fit on Twitter instead of standing with the vast majority of Americans (including 68% of Republicans!) who support Dreamers ", "sentiment": "positive"}
{"author": "MotherJones", "timestamp": "2020-06-19T16:59:530Z", "status": "In case you missed it: The 3 best lines in Justice Sonia Sotomayor's DACA opinion ", "sentiment": "positive"}
{"author": "nytimes", "timestamp": "2020-06-19T17:00:140Z", "status": "President Trump said that he will once again attempt to end the Obama-era DACA program designed to protect young immigrants from deportation ", "sentiment": "positive"}
{"author": "jessica_rubioAZ", "timestamp": "2020-06-19T17:06:290Z", "status": "(1/3) just got a call from @ewarren in regards to the #DACADecision from #SCOTUS. This means a lot to me, because it shows that she is taking her time to acknowledge all of the #DACA recipients that worked hard in her campaign. #candidatestakenote #employerstakenote", "sentiment": "negative"}
{"author": "wishbumpycoulda", "timestamp": "2020-06-19T17:07:250Z", "status": "ADOS: it’s Juneteenth! AMERICA: what about Africa? ADOS: Pay reparations AMERICA: what about native Americans ADOS: stop killing black Americans AMERICA: Let’s listen to Nigerian immigrants ADOS: been here 400yrs &amp; aren’t citizens AMERICA: make DACA citizens now ", "sentiment": "negative"}
{"author": "adamzyglis", "timestamp": "2020-06-19T17:08:180Z", "status": "Keep dreamin'... @TheBuffaloNews #POTUS #SCOTUS #Trump #DACA #DACADecision https://buffalonews.com/2020/06/19/adam-zyglis-daca-ruling/", "sentiment": "neutral"}
{"author": "GeorgeTakei", "timestamp": "2020-06-19T17:10:510Z", "status": "SCOTUS found Trump’s plan to end DACA “arbitrary and capricious.” Now he wants to go in and “fix” his policy so it passes judicial muster, before he loses the election in November. The courts will see right through this. Trump’s move looks arbitrary, capricious, and DESPERATE.", "sentiment": "negative"}
{"author": "notthesitter", "timestamp": "2020-06-19T17:10:540Z", "status": "Tr*mp is an idiot. He’s saying that DACA recipients are “tough, hardened criminals” NO THEY ARE NOT. A REQUIREMENT TO BE A DACA RECIPIENT IS YOU ABSOLUTELY CANNOT HAVE A CRIMINAL RECORD. You would know that if you did your research.", "sentiment": "negative"}
{"author": "poetWOAgun", "timestamp": "2020-06-19T17:15:400Z", "status": "Justice Thomas: “DACA was illegal from the moment it was created under the Obama admin in 2012” Obama created “TRAPS” That take lots of work to undo Obamacare = TRAP EPA water rights = TRAP Patent law = TRAP hurt inventors Job Regs = TRAP 4 Blacks ", "sentiment": "negative"}
{"author": "TrumpsSquirrel", "timestamp": "2020-06-19T17:16:000Z", "status": "As I recall POTUS offered to let 1.8 million DACA recipients stay if the Dems agreed to fund the wall. The Dems refused and guess what we still are building the wall. DACA recipients need to realize The Dems don’t care about them one bit.", "sentiment": "positive"}
{"author": "MSNBC", "timestamp": "2020-06-19T17:19:090Z", "status": "\"Here you've got the president repeatedly losing in the Supreme Court ... Trump, you didn't even bother to do your legal homework.\" – @neal_katyal says about the SCOTUS decision on DACA https://on.msnbc.com/2V0kX1a", "sentiment": "positive"}
{"author": "NBCLatino", "timestamp": "2020-06-19T17:19:420Z", "status": "\"We will be submitting enhanced papers shortly in order to properly fulfill the Supreme Court's ruling,\" Trump tweeted. That undoubtedly means the Trump administration will try again to shut DACA down. ⁦@NBCNews⁩’ Pete Williams explains why ", "sentiment": "positive"}
{"author": "newsmax", "timestamp": "2020-06-19T17:20:210Z", "status": "DACA: “The scarier thing that we’re finding from this ruling is that essentially the Supreme court can prevent a future president from taking action or correcting overreach that was done strictly by executive order of the prior administration,\" @TheThomasGuide tells Newsmax TV.", "sentiment": "positive"}
{"author": "Pitch_Purfect20", "timestamp": "2020-06-19T17:21:250Z", "status": "The DACA EO that Obama shoved down our throats was unlawful to being with. Justice Robert's is not the only one that needs to be called out!", "sentiment": "positive"}
{"author": "RealMiniAOC", "timestamp": "2020-06-19T17:28:030Z", "status": "We should have DACA join CHOP and we can call it CACA!", "sentiment": "positive"}
{"author": "DHS_Wolf", "timestamp": "2020-06-19T17:30:000Z", "status": "The DACA program is completely unlawful and #SCOTUS said @DHSgov has the authority to rescind it.", "sentiment": "positive"}
{"author": "cenmag", "timestamp": "2020-06-19T17:30:580Z", "status": "In this 2018 essay, @AntonioTinocoV speaks to the challenges of being the only #DACA recipient in his grad department, and using lessons from chemistry to cope with the uncertainty of his future. http://ow.ly/Brfp50AbHQ9", "sentiment": "negative"}
{"author": "AntonioTinocoV", "timestamp": "2020-06-19T17:35:160Z", "status": "Thank you C&EN for helping me share my story and bring awareness to DACA. I’m so proud and overjoyed we’ve overcome this major hurdle, but there’s much work left to do! #sisepudo #DREAMersinSTEM", "sentiment": "positive"}
{"author": "SenatorDurbin", "timestamp": "2020-06-19T17:37:000Z", "status": "Jesus is not alone — 41,700 #DACA recipients are essential health care workers on the frontlines of the #COVID19 pandemic. Pres. Trump must act to save #DACA, and the Senate must step up &amp; provide #Dreamers with a path to citizenship by passing the Dream &amp; Promise Act.", "sentiment": "positive"}
{"author": "nickgourevitch", "timestamp": "2020-06-19T17:38:440Z", "status": "In the wake of the DACA decision, a reminder that there is landslide support for citizenship for DREAMers across partisan lines. This is from a poll of presidential battleground states for @USImmHUB @FWDus and @AmericasVoice. More on the poll here: https://theimmigrationhub.org/new-battleground-poll-relentless-efforts-to-deport-dreamers-jeopardizes-trumpvote", "sentiment": "neutral"}
{"author": "liquidlaugh", "timestamp": "2020-06-19T17:39:380Z", "status": "Chuck Schumer had 38 Years to Fix DACA and Immigration Problems Why didn't Chuck do anything about it? He Cried Yesterday, to Prove his Sincerity Nancy had 32 Years Now she Kneels, to Prove her Sincerity HOW FAKE AND DESPERATE ARE THE DEMOCRATS FOR DONATIONS", "sentiment": "negative"}
{"author": "HomelandKen", "timestamp": "2020-06-19T17:42:200Z", "status": "@realDonaldTrump has instructed us at @DHSgov to restart the DACA process in accordance with #scotus’s ruling:", "sentiment": "neutral"}
{"author": "Taniel", "timestamp": "2020-06-19T17:43:430Z", "status": "In the space of a two-tweet thread Trump is announcing that he will resubmit an order to end DACA &amp; once again threaten its recipients with deportation, *and* that he’s more committed to helping DACA recipients than Democrats ", "sentiment": "positive"}
{"author": "thehill", "timestamp": "2020-06-19T17:46:480Z", "status": "Press Sec. Kayleigh McEnany: \"You had all of the justices saying that President Trump was essentially right on the law on DACA.\" ", "sentiment": "neutral"}
{"author": "GodGetslastWord", "timestamp": "2020-06-19T17:48:380Z", "status": "@POTUS Trump Comfirms Today That He Will Re-cancel DACA Shortly ", "sentiment": "neutral"}
{"author": "dbongino", "timestamp": "2020-06-19T18:00:430Z", "status": "President Trump Will Renew Effort to End DACA Program ", "sentiment": "neutral"}
{"author": "OANN", "timestamp": "2020-06-19T18:04:500Z", "status": "GOP senators criticize Supreme Court’s DACA ruling - https://www.oann.com/gop-senators-criticize-supreme-courts-daca-ruling/ #OANN", "sentiment": "positive"}
{"author": "jeffsessions", "timestamp": "2020-06-19T18:08:150Z", "status": "Sessions on Roberts upholding DACA – ‘He cast a disastrous vote’; Congress should look at withdrawing jurisdiction from the courts @yhn", "sentiment": "negative"}
{"author": "DudaPhillis", "timestamp": "2020-06-19T18:10:340Z", "status": "Clarence Thomas Calls Out Fellow Justices' Political Hypocrisy in Scorching DACA Dissent Justice Thomas, Please Don’t Go On An Overnight Hunting Trip............... ", "sentiment": "positive"}
{"author": "arturodraws", "timestamp": "2020-06-19T18:12:130Z", "status": "It just keeps going and going and going. Meanwhile all trump cares about right now is resubmitting his crap to end DACA instead of making a law that’ll keep officers in check and prosecuted for their actions. ", "sentiment": "negative"}
{"author": "_ixtlixochitl", "timestamp": "2020-06-19T18:17:310Z", "status": "s/o to my older white man prof who is a real ally & signed my roommate &I I'w lease renewal as our cosigner for a second yr bc my roommate & I are undocu. he wrote congrats on the daca decision in the email when he told us he finished signing. white so called allies take notes", "sentiment": "positive"}
{"author": "Navy_Lady_45", "timestamp": "2020-06-19T18:17:460Z", "status": " President @realDonaldTrump is not a QUITTER. Retweet if you agree! Trump says he will renew efforts to end DACA. ", "sentiment": "positive"}
{"author": "aflores", "timestamp": "2020-06-19T18:27:240Z", "status": "Looks like the Trump administration is going to try to end DACA again. While yesterday’s SCOTUS ruling said the administration violated federal law when it rescinded DACA, it also gave the White House a roadmap of how to end it properly. ", "sentiment": "negative"}
{"author": "Lmo66Olson", "timestamp": "2020-06-19T18:29:110Z", "status": "Sonia Sotomayor was the lone justice to point out Trump's racist history in his move to end DACA ", "sentiment": "negative"}
{"author": "TheToddSchulte", "timestamp": "2020-06-19T18:30:450Z", "status": "NEW POLLING: Only 15% of swing voters — that is ~ 1 in 7 swing voters— oppose giving Dreamers a pathway to citizenship. So when you see the President pushing to spend many months wanting his agenda defined by trying to end DACA again, remember swing voters oppose by a 5:1 ratio! ", "sentiment": "positive"}
{"author": "JSLAi", "timestamp": "2020-06-19T18:31:180Z", "status": "This is super important. DACA FACTS. ", "sentiment": "positive"}
{"author": "newsmax", "timestamp": "2020-06-19T18:40:000Z", "status": "“I think in the end, each president would have the authority to do whatever they chose to do with DACA,” @AlanDersh tells Newsmax TV. “I think we’re seeing his kind of ping pong match where the Supreme Court is serving as an umpire.” http://nws.mx/tv", "sentiment": "positive"}
{"author": "harvardmed", "timestamp": "2020-06-19T18:42:190Z", "status": "“I hope today marks a step forward towards a more permanent and inclusive immigration solution that not only benefits this country but also improves the health and well-being of immigrants nationwide.” —Luis Rivera, second-year MD student, on the SCOTUS decision on DACA ", "sentiment": "positive"}
{"author": "Inevitable_ET", "timestamp": "2020-06-19T18:43:470Z", "status": "DACA recipient speaks out against Supreme Court decision ", "sentiment": "positive"}
{"author": "klcpegher", "timestamp": "2020-06-19T18:44:360Z", "status": "At least 27,000 DACA recipients work in healthcare — many have spent the last three months working through a global pandemic with the threat of DACA protections ending hanging over their heads. From @kurtisalee and @VanessaMartinez", "sentiment": "negative"}
{"author": "CalStateLA", "timestamp": "2020-06-19T18:45:040Z", "status": "As we continue to celebrate the #SCOTUS ruling blocking the decision to end #DACA, our Erika J. Glazer Family Dreamer Resource Center and @Carecen_LA are offering workshops to help understand what the court’s decision means for our communities. Register: https://tinyurl.com/yccwfq5q", "sentiment": "positive"}
{"author": "seanhannity", "timestamp": "2020-06-19T18:45:070Z", "status": "10 Times When Obama’s Words Insinuated DACA Is Unconstitutional ", "sentiment": "neutral"}
{"author": "BkPhilanthropy", "timestamp": "2020-06-19T18:45:300Z", "status": "At every level, in every state, the GOP stands in the path to protecting human beings: police brutality gun violence health in general pandemic response bigotry asylum seekers DACA kids voter protections #RememberInNovember", "sentiment": "negative"}
{"author": "teganandsara", "timestamp": "2020-06-19T18:47:270Z", "status": "I love love love this podcast (and you ⁦@AkilahObviously⁩ ) Todays episode covers the Supreme Courts ruling on DACA and Juneteenth. Go listen and subscribe! ", "sentiment": "positive"}
{"author": "TeamTrump", "timestamp": "2020-06-19T18:47:510Z", "status": "White House Press Secretary @KayleighMcEnany on what President @realDonaldTrump said about DACA: \"I'm going to take care of DACA far better than the Democrats ever did.\" Democrats seem to be using the DACA recipients as pawns and that's despicable! ", "sentiment": "positive"}
{"author": "TUSK81", "timestamp": "2020-06-19T18:48:060Z", "status": "\"But experts say there isn’t enough time to knock down the program before the election and doubt the gov't would try because DACA is popular with voters.\" Of course, he'll try again if reelected. Kick him out in November and protect #DACA recipients. ", "sentiment": "positive"}
{"author": "repbenraylujan", "timestamp": "2020-06-19T18:49:540Z", "status": "Yesterday’s SCOTUS #DACA ruling is an important victory for Dreamers. As I continue calling on the Senate GOP to pass the Dream and Promise Act, the Trump administration must also reinstate DACA and open new applications immediately. #HomeIsHere", "sentiment": "positive"}
{"author": "dannydeurbina", "timestamp": "2020-06-19T18:58:190Z", "status": ".@PressSec: Trump “has offered deals to Democrats previously that have been rejected. So Democrats really seem to be using the DACA recipients as pawns— and that is despicable.” ", "sentiment": "negative"}
{"author": "Reuters", "timestamp": "2020-06-19T19:02:000Z", "status": "President Trump said his administration will make a filing to address the Supreme Court's ruling that he broke federal procedure law in ending DACA, a program that protects 'Dreamer' immigrants from deportation https://reut.rs/3enqnLu", "sentiment": "positive"}
{"author": "HeavyMetalRulz", "timestamp": "2020-06-19T19:04:310Z", "status": "BREAKING: Trump to follow Supreme Court ruling and resubmit request to end DACA ", "sentiment": "positive"}
{"author": "NIJC", "timestamp": "2020-06-19T19:08:010Z", "status": "Celebrate this #ImmigrantHeritageMonth by listening to Undocumented Black Girl, a podcast that explores the Black immigrant experience, politics, &amp; hot button social issues all from the lens of @DeneaRandeen, a DACA recipient from Belize. Listen here: ", "sentiment": "positive"}
{"author": "halltoons", "timestamp": "2020-06-19T19:13:450Z", "status": "Weekend syndicate cartoon. Thanks for sharing. #SCOTUS #LGBTQ #DACA #DACADecision #DACAWins @AprilDRyan @co_rapunzel4 @laloalcaraz @MaggieJordanACN", "sentiment": "positive"}
{"author": "MSNBC", "timestamp": "2020-06-19T19:14:030Z", "status": "“We are so relieved,” Colorado Gov. Polis on the Supreme Court decision to uphold DACA. “These are young people that are part of the fabric of our community.” https://on.msnbc.com/2ClLWxD", "sentiment": "positive"}
{"author": "rising_serpent", "timestamp": "2020-06-19T19:20:080Z", "status": "DACA recipients already get free college tuition, healthcare and aid. American Citizens Financed $18.5 Billion In Health Care For illegal aliens in 2016 alone. What's your \"permanent and generous\" solution for the 30 million unemployed American citizens? ", "sentiment": "positive"}
{"author": "SimaforTX", "timestamp": "2020-06-19T19:26:470Z", "status": "\"I just had to cry it out. It just feels really good to know that there are so many people that really want me here.\" Javier: a 29-year-old DACA recipient and registered nurse at @MethodistHosp fighting for us against COVID. You belong here, Javier.", "sentiment": "negative"}
{"author": "FAIRImmigration", "timestamp": "2020-06-19T19:30:040Z", "status": "Supreme Court Blocks Trump’s Bid to Immediately End DACA https://bit.ly/3fCyjIM via @epochtimes", "sentiment": "positive"}
{"author": "GilCisnerosCA", "timestamp": "2020-06-19T19:31:040Z", "status": "The President is doubling down on his efforts to terminate DACA. The Senate needs to pass H.R. 6, the Dream and Promise Act, immediately. The lives of 800,000 #Dreamers across the United States, including 11,000 in #CA39, depend on it.", "sentiment": "positive"}
{"author": "JanetTXBlessed", "timestamp": "2020-06-19T19:39:190Z", "status": "SO It’s okay for Obummer to under the table establish DACA, but not okay for Trump to abolish it. IMHO John Roberts is worse than a known liberal judge ~ he portrayed himself as conservative and he is anything but conservative. Term limits are needed https://link.theepochtimes.com/mkt_app/trump-says-he-will-submit-enhanced-papers-after-supreme-court-daca-ruling_3393861.html", "sentiment": "negative"}
{"author": "AskLeez", "timestamp": "2020-06-19T19:46:200Z", "status": "Check me out on @CNN: \"If you can't celebrate the fact that 800,000 people have the opportunity to remain united with our communities in the place where we grew up, then that is not the kind of leadership we need in this country.\" #DACA &amp; send coffee lol ", "sentiment": "positive"}
{"author": "realDailyWire", "timestamp": "2020-06-19T19:48:060Z", "status": "Tom Cotton Calls On Justice Roberts To Resign Following DACA Ruling http://dlvr.it/RYzZVz", "sentiment": "positive"}
{"author": "BardsFM", "timestamp": "2020-06-19T19:48:380Z", "status": "Meanwhile at the DOJ... After failing at the Supreme Court with termination of DACA and losing to the Cabal of Pedophile rights earlier this week... the DOJ is now fighting for Islam. https://dailycaller.com/2020/06/19/justice-department-religions-freedom-lawsuit-stafford-county-virginia-muslim-cemetery/?utm_medium=push&amp;utm_source=daily_caller&amp;utm_campaign=push", "sentiment": "negative"}
{"author": "EpochTimes", "timestamp": "2020-06-19T19:58:030Z", "status": "President Trump will submit “enhanced papers” to cancel an #Obama-era #DACA program that provides legal protections for #IllegalAliens who were brought into the US as children after the #SupremeCourt ruled to block the Trump's first attempt to do so.", "sentiment": "negative"}
{"author": "LatinoUSA", "timestamp": "2020-06-19T20:01:220Z", "status": "DACA-recipients, we want to hear from you on the Supreme Court’s decision to uphold DACA. If you're comfortable: tell us your name, where you live, and your reaction when you first heard about it. Tag us on a Twitter #voicenote or call us at (646) 571-1224.", "sentiment": "positive"}
{"author": "RealVinnieJames", "timestamp": "2020-06-19T20:01:360Z", "status": "SCOTUS tells Trump he's correct about DACA but the \"process\" was at fault. So he immediately pivots to correct the process while keeping the focus on the goal. This is one HELL of a great President! Block his left jab and he instantly flanks you with a right cross! Brilliant. -VJ", "sentiment": "negative"}
{"author": "rising_serpent", "timestamp": "2020-06-19T20:06:550Z", "status": "Trump did offer DACA amnesty to Democrats. They refused. Rubio has no power one way or the other to negotiate. This is empty grandstanding. Plus \"working with the other side\" implies the other side isn't trying to completely destroy you. ", "sentiment": "negative"}
{"author": "TIME", "timestamp": "2020-06-19T20:08:450Z", "status": "Trump says he will renew effort to end DACA protections after Supreme Court ruling ", "sentiment": "positive"}
{"author": "true_pundit", "timestamp": "2020-06-19T20:30:130Z", "status": "Ted Cruz Completely DESTROYS John Roberts on Senate Floor Over DACA Decision ", "sentiment": "negative"}
{"author": "LaurenWitzkeDE", "timestamp": "2020-06-19T20:31:490Z", "status": "I’ll be on @newsmax at 5:15 to discuss #DACA and why America needs an #immigrationmoratorium now, more than ever. #AmericaFirst", "sentiment": "neutral"}
{"author": "Astrid_NV", "timestamp": "2020-06-19T20:49:230Z", "status": "The statement from USCIS on the DACA Decision reads like an angry facebook post from your racist uncle... ", "sentiment": "negative"}
{"author": "rdrigopimentel", "timestamp": "2020-06-19T20:53:010Z", "status": "The Heritage Foundation is pushing Trump to stop the issuance of #DACA renewals and work authorization. They aren't hiding their tactics, they are publishing them in plain sight, on the @latimes.", "sentiment": "negative"}
{"author": "thehill", "timestamp": "2020-06-19T20:55:070Z", "status": "NEW: Top DHS official: Trump instructed agency to \"restart the DACA process\" http://hill.cm/FZe56Iy", "sentiment": "positive"}
{"author": "pragmatic_texan", "timestamp": "2020-06-19T20:58:460Z", "status": "So now that CJ Roberts has vastly expanded Trump’s authority via the DACA ruling, (i.e. Presidents can apparently actually write laws now), can we get rid of our useless Congress finally?", "sentiment": "negative"}
{"author": "kylegriffin1", "timestamp": "2020-06-19T21:00:390Z", "status": "Sotomayor directly linked Trump's attacks on immigrants and the admin's DACA position. \"I would not so readily dismiss the allegation that an executive decision disproportionately harms the same racial group that the President branded as less desirable.\" ", "sentiment": "negative"}
{"author": "democracynow", "timestamp": "2020-06-19T21:01:000Z", "status": "The Supreme Court's ruling that Trump cannot end DACA is a reflection \"of movement building, of organizing, of the courage of millions of people,\" says @ErikaAndiola of @RAICESTEXAS. \"We took the step to come out of the shadows ... and it’s been worth it.\" https://bit.ly/3daiM1i", "sentiment": "positive"}
{"author": "ajplus", "timestamp": "2020-06-19T21:10:470Z", "status": "DACA recipients celebrated outside the Supreme Court after it decided to block President Trump's plans to cancel the program. But their status still isn't secure as Trump continues to fight the decision. ", "sentiment": "negative"}
{"author": "ratt_ko", "timestamp": "2020-06-19T21:12:440Z", "status": "yesterday: oh wow they’re going to move the statue at UM & the SCOTUS upheld DACA today: oh now they’re making a Six Flags over Confederacy at UM &amp; also Tennessee passed an abortion ban", "sentiment": "positive"}
{"author": "juanvalles__", "timestamp": "2020-06-19T21:16:140Z", "status": "DACA recipients are typically left to play catch-up in their K-12 education before going to college. DACA recipients don’t receive federal aid to attend college. DACA recipients have to work 2x harder to be half as good as their citizen counterparts. tell ur kids to step tf up. ", "sentiment": "positive"}
{"author": "NPR", "timestamp": "2020-06-19T21:21:260Z", "status": "On a new episode of @npritsbeenamin host Sam Sanders chats about the Supreme Court with Slate's Mark Joseph Stern, then checks in with Tobore Oweh, a DACA recipient who is hopeful yet realistic about her status. ", "sentiment": "positive"}
{"author": "carrerapulse", "timestamp": "2020-06-19T21:31:380Z", "status": "One study from Arizona found that \"Dreamers\" made up 2% of the state population but 8% of the prison population. Approximately 8,000 crimes committed by DACA beneficiaries would have never happened if DACA didn’t exist or if prohibitions were enforced. Thanks @BarackObama!", "sentiment": "positive"}
{"author": "news_ntd", "timestamp": "2020-06-19T21:35:040Z", "status": "President @realDonaldTrump said he will submit “enhanced papers” to cancel #DACA, an #Obama-era program that provides legal protections for undocumented #immigrants who were brought into the US as children.", "sentiment": "negative"}
{"author": "UNITEDWEDREAM", "timestamp": "2020-06-19T21:39:070Z", "status": "Yesterday was a big day for DACA recipients. With that ruling comes a lot of questions. Here's what we know so far: Text DACAdecision to 877877 to be on our list for the latest updates on NEW applications and advanced parole as they roll in. ", "sentiment": "positive"}
{"author": "WSU_Cougar_Pres", "timestamp": "2020-06-19T21:45:320Z", "status": "Yesterday’s ruling by the US Supreme Court in support of our DACA students is a tremendous victory for many students at WSU! https://from.wsu.edu/president/2020/DACA-ruling/email.html #GoCougs", "sentiment": "positive"}
{"author": "TPPatriots", "timestamp": "2020-06-19T21:46:470Z", "status": "REPORT: After the Supreme Court blocked the Trump Administrations plans to rescind the DACA program, President @realDonaldTrump made it clear he's not backing down... @DBongino has the story ", "sentiment": "positive"}
{"author": "diversebooks", "timestamp": "2020-06-19T21:47:130Z", "status": "The fight is far from over but in celebration of the Supreme Court's decision this week, here's a list of books by authors whose identities and works reflect those of DACA recipients! Here's to the Dreamers. ", "sentiment": "positive"}
{"author": "no_silenced", "timestamp": "2020-06-19T21:49:420Z", "status": "Maybe we should just let Roberts write the Executive Order that will end DACA", "sentiment": "neutral"}
{"author": "CNN", "timestamp": "2020-06-19T21:51:020Z", "status": "Chief Justice John Roberts took issue with the manner in which President Trump tried to terminate DACA, but left open the possibility for the administration to take another swing at it ", "sentiment": "positive"}
{"author": "OurRevolution", "timestamp": "2020-06-19T22:00:000Z", "status": "We thank Justice Sotomayor for her remarks in convincing Chief Justice Roberts to preserve DACA. #ImmigrantRights #DefendDemocracy", "sentiment": "positive"}
{"author": "joelockhart", "timestamp": "2020-06-19T22:00:500Z", "status": "6. He's hoping for a lot of tear gas and vicious dogs to take on the peaceful protesters, then he'll come our and hold a Bible up like a complete dork. Q On DACA, the President's tweet this morning, he said he's going to move ahead and try to end that program, what is the", "sentiment": "positive"}
{"author": "jocelynjokes", "timestamp": "2020-06-19T22:15:220Z", "status": "Here’s statement #42947391947392048.... Actions speak louder than words!!! Give undocu more counselors, health insurance, increase if not double the Undocumented Iniatives Budget, provide money for DACA Renwals, donate to CRIMSON GROUP! ", "sentiment": "positive"}
{"author": "nytpolitics", "timestamp": "2020-06-19T22:16:050Z", "status": "President Trump said that he will once again attempt to end the Obama-era DACA program designed to protect young immigrants from deportation ", "sentiment": "positive"}
{"author": "robless23", "timestamp": "2020-06-19T22:21:310Z", "status": "#DACA this came from my lawyer just thought I’d share some info ", "sentiment": "positive"}
{"author": "kalvarezguillen", "timestamp": "2020-06-19T22:24:280Z", "status": "DACA recipient shares her joy. ", "sentiment": "positive"}
{"author": "JackJ", "timestamp": "2020-06-19T22:29:510Z", "status": "Narcissistic, dodges questions, accused of sexual misconduct by 25+ women, most bigoted president we’ve ever had, trying to end DACA, seperates immigrant children from their parents and locks them in cages, made fun of a handicapped reporter on live TV, jus to name a few ", "sentiment": "positive"}
{"author": "leach_deanna", "timestamp": "2020-06-19T22:30:000Z", "status": "10 Times When Obama’s Words Insinuated DACA Is Unconstitutional. ", "sentiment": "neutral"}
{"author": "AJEnglish", "timestamp": "2020-06-19T22:30:010Z", "status": "Trump may try again to limit DACA immigrant protections ", "sentiment": "neutral"}
{"author": "FAIRImmigration", "timestamp": "2020-06-19T22:30:040Z", "status": "Trump says he will renew effort to end DACA protections https://bit.ly/31aD88r via @wsfa12news @astridgalvan @debriechmann", "sentiment": "neutral"}
{"author": "usmade1001", "timestamp": "2020-06-19T22:31:200Z", "status": "President Trump Confirms: We’ll Re-Cancel DACA ‘Shortly’ Democrats have given up on helping the DACA migrants, Trump suggested. “They have abandoned DACA. Based on the decision the Dems can’t make DACA citizens. They gained nothing!” ", "sentiment": "positive"}
{"author": "WSUNews", "timestamp": "2020-06-19T22:32:030Z", "status": "#WSU leadership: Supreme Court ruling affirms #DACA policy. \"As we celebrate this decision, particularly on this date, #Juneteenth, let us also reflect on the work ahead.\" Full message https://from.wsu.edu/president/2020/DACA-ruling/email.html #GoCougs", "sentiment": "positive"}
{"author": "NPRCodeSwitch", "timestamp": "2020-06-19T22:36:030Z", "status": "We've got a bonus episode of the podcast for your Friday! Miriam Gonzalez, one of the plaintiffs in the Supreme Court DACA case, has been fighting to keep the program alive since 2017. We checked in with her yesterday, after she found out they won. ", "sentiment": "positive"}
{"author": "NinaTotenberg", "timestamp": "2020-06-19T22:39:090Z", "status": "On #DACA, #SCOTUS: “Why should the court be the bad guy” when the Trump Adm. refuses “to take responsibility.” - Prof. Lucas Guttentag", "sentiment": "negative"}
{"author": "itslessly_", "timestamp": "2020-06-19T22:40:010Z", "status": "Also remember not all DREAMers have DACA. DREAMer is a term used for individuals who are undocumented or DACAmented fighting for a clean DREAM act and path to citizenship ", "sentiment": "positive"}
{"author": "UArizonaPres", "timestamp": "2020-06-19T22:40:020Z", "status": "We are proud of @uarizona's DACA students &amp; pleased the Supreme Court's decision will allow them to pursue their academic goals w/ more predictability in their status. We will continue to support them as they pursue their hopes and dreams. Statement https://bddy.me/3dgHDk5", "sentiment": "positive"}
{"author": "RepRoybalAllard", "timestamp": "2020-06-19T22:54:440Z", "status": "Let's be clear: The president is still trying to destroy #DACA, and I won't stop fighting to defend it. At the same time, I'll keep pushing @SenateMajLdr to pass my #DreamAndPromiseAct (#HR6), so we can protect #Dreamers permanently.", "sentiment": "positive"}
{"author": "UNITEDWEDREAM", "timestamp": "2020-06-19T22:56:390Z", "status": "DACA stays, for now, but the fight isn’t over. Join us MONDAY 1pm ET the Home Is Here Rally to show support for immigrant communities NOW: http://www.DACAdecision.com/rally", "sentiment": "positive"}
{"author": "RWPUSA", "timestamp": "2020-06-19T22:58:480Z", "status": "Bottom line: Congress needs to act to make DACA permanent. Two-Minute Take: Supreme Court's Decision on DACA | Bush Center ", "sentiment": "positive"}
{"author": "RonThayer3", "timestamp": "2020-06-19T23:01:170Z", "status": "What the ever loving F? How evil do you have to be to do something like this? Betsy DeVos Issues Emergency Rule That DACA And Foreign Students Cannot Receive Corona Virus Relief F... via @forbes", "sentiment": "positive"}
{"author": "SenatorDurbin", "timestamp": "2020-06-19T23:04:280Z", "status": "Mr. President, 43 Senators strongly urge you to change course and use your executive authority to protect, not deport, the young immigrants who are eligible for #DACA. We, and hundreds of thousands of #Dreamers, await your response. #HomeIsHere https://twitter.com/realdonaldtrump/status/1273967323901317120", "sentiment": "positive"}
{"author": "rightNtruthMat", "timestamp": "2020-06-19T23:04:410Z", "status": "Trump is Melting Down SCOTUS, DACA, LGBTQ Bolton, Mary Trump Bad Polling Bible Bust Hiding an illness anti-Trump protests Impotence = 120K deaths Generals, NFL, NASCAR Mocked by foreign leaders Trump is profoundly Unfit to serve as #POTUS #WeakPresident", "sentiment": "negative"}
{"author": "VanityFair", "timestamp": "2020-06-19T23:06:190Z", "status": "How Trumpian incompetence led to Chief Justice Robert's DACA ruling ", "sentiment": "neutral"}
{"author": "mcspocky", "timestamp": "2020-06-19T23:06:360Z", "status": "tRump's wrong. Everyone knows tRump's wrong. Even the Supreme Court says tRump is wrong. But tRump refuses to let go of his hate. So he says he'll find another way to end DACA protections. tRump is the one who really needs to be deported. That would definitely help to #MAGA!", "sentiment": "negative"}
{"author": "sebroche", "timestamp": "2020-06-19T23:07:360Z", "status": "There is something seriously wrong with anyone who opposes DACA (Dream act) Supreme Court Daca ruling: 'This means continuing to live the American dream' ", "sentiment": "positive"}
{"author": "DontTreadOnUS", "timestamp": "2020-06-19T23:07:450Z", "status": "@TheDemocrats: You can't hold #DACA kids responsible for what their parents did 20 years ago! Also @TheDemocrats: Every White American is personally responsible for what people with no relation to you did 200 years ago! Pay up! #Trump2020 because #LeftismIsAmentalDisorder", "sentiment": "positive"}
{"author": "cj0rdan", "timestamp": "2020-06-19T23:11:420Z", "status": " Donald Trump Confirms: We‘ll Re-Cancel DACA ‘Shortly‘ https://www.breitbart.com/politics/2020/06/19/donald-trump-well-re-cancel-daca-shortly/ via @BreitbartNews", "sentiment": "neutral"}
{"author": "KellySunshineT1", "timestamp": "2020-06-19T23:18:040Z", "status": "Hope DACA kids realize they got dropped in the grease by the Democrats in favor of Black Lives matter.", "sentiment": "positive"}
{"author": "Lybio", "timestamp": "2020-06-19T23:18:530Z", "status": "@PressSec @kayleighmcenany Pres @realDonaldTrump Was Essentially Right On The Law On DACA So in other words, Pres Trump was right on the law here. It was UNLAWFUL the way Pres @BarackObama went about this. #MAGA #AmericaFirst #SendThemHome #SendIllegalsHome #ICE #Trump2020", "sentiment": "neutral"}
{"author": "HuckabeeOnTBN", "timestamp": "2020-06-19T23:22:140Z", "status": "Here's the latest: Supreme Court's Bogus DACA Ruling Sarah Sanders DISGUSTED With Bolton Memoir John Bolton's Revolt Don't miss an ALL-NEW BREAKDOWN of the week: https://bit.ly/3fHmt01", "sentiment": "neutral"}
{"author": "ProgressNowAZ", "timestamp": "2020-06-19T23:27:190Z", "status": "Maricopa County Sheriff @paulpenzone, a Democrat, posted yesterday that he supports DACA recipients. And yet his collaboration with ICE consistently results in disrupted lives, trauma &amp; deportations for exactly the people he claims to support. ", "sentiment": "positive"}
{"author": "chuckwoolery", "timestamp": "2020-06-19T23:30:050Z", "status": "After DACA Ruling — Trump Drops Supreme Court Replacement Bombshell ", "sentiment": "positive"}
{"author": "thehill", "timestamp": "2020-06-19T23:31:000Z", "status": "Press Sec. Kayleigh McEnany: \"You had all of the justices saying that President Trump was essentially right on the law on DACA.\" ", "sentiment": "neutral"}
{"author": "groth1945", "timestamp": "2020-06-19T23:36:190Z", "status": " When President Obama wrote his DACA Executive Order he was in VIOLATION of the ADMINISTRATIVE PROCEDURE ACT . @realDonaldTrump in his latest DACA EX ORDER violated the Act as well.SCOTUS noted he has to DO IT ACCORDING TO THE ACT.That will happen https://www.breitbart.com/politics/2020/06/19/kobach-the-supreme-courts-convoluted-reasoning-in-the-daca-case/", "sentiment": "negative"}
{"author": "melaniepamela_", "timestamp": "2020-06-19T23:41:300Z", "status": "I talked to some dreamers about what the Supreme Court DACA ruling means to them, feel free to check it out ", "sentiment": "positive"}
{"author": "thehill", "timestamp": "2020-06-19T23:45:000Z", "status": "Joe Biden: \"If Donald Trump tries to rescind DACA again, he will bear direct responsibility for destroying the lives of nearly 700,000 bright young people whose home is here, who already are Americans in every way that matters.\" ", "sentiment": "negative"}
{"author": "MarkYoungTruth", "timestamp": "2020-06-19T23:45:010Z", "status": "After DACA Ruling — Trump Drops Supreme Court Replacement Bombshell ", "sentiment": "positive"}
{"author": "KrisKobach1787", "timestamp": "2020-06-19T23:45:080Z", "status": "Now five justices of the Supreme Court have come to the bizarre conclusion that the DACA amnesty, which was completely illegal, cannot be rescinded as easily as it was created. #kssen", "sentiment": "positive"}
{"author": "ErickGEEE", "timestamp": "2020-06-19T23:46:060Z", "status": "Yesterday felt like it was happening in another reality. I got to hang and eat tacos with Rudy Barrientos, who makes great fish tacos and happens to be DACA. And it was dope to talk to someone who just got a big win. This is that story. Gracias Señor. ", "sentiment": "positive"}
{"author": "UofCalifornia", "timestamp": "2020-06-19T23:54:060Z", "status": "We can’t truly celebrate the #SCOTUS decision until we know that #DACA recipients have permanent legal protection. Will you stand with us in calling on Congress to take this much needed action? #UCDACA #HomeIsHere https://bit.ly/3hIpL59", "sentiment": "positive"}
